TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_iomux_m33c1__include
#define ti_devices_msp_peripherals_hw_iomux_m33c1__include

/* Filename: hw_iomux_m33c1.h */
/* Revised: 2025-04-09 13:57:08 */
/* Revision: f4602b816b1643a266cc7aae6be755d35f394359 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* IOMUX_M33C1 Registers
******************************************************************************/
#define IOMUX_M33C1_UNASSIGNED_MMR_REGION_OFS    ((uint32_t)0x00001000U)
#define IOMUX_M33C1_SECCFG_MMR_REGION_OFS        ((uint32_t)0x00000000U)


/** @addtogroup IOMUX_M33C1_UNASSIGNED_MMR_REGION
  @{
*/

typedef struct {
       uint32_t RESERVED0[576];
  __IO uint32_t DTBENA;                            /* !< (@ 0x00001900) DTBENA Register */
       uint32_t RESERVED1[2];
  __IO uint32_t DTBBUSSEL;                         /* !< (@ 0x0000190C) DTBBUSSEL Register */
  __IO uint32_t DTBOUTSEL0;                        /* !< (@ 0x00001910) DTBOUSEL0 Register */
  __IO uint32_t DTBOUTSEL1;                        /* !< (@ 0x00001914) DTBOUSEL1 Register */
  __IO uint32_t DTBOUTSEL2;                        /* !< (@ 0x00001918) DTBOUSEL2 Register */
  __IO uint32_t DTBOUTSEL3;                        /* !< (@ 0x0000191C) DTBOUSEL3 Register */
  __IO uint32_t DTBOUTSEL4;                        /* !< (@ 0x00001920) DTBOUSEL4 Register */
  __IO uint32_t DTBOUTSEL5;                        /* !< (@ 0x00001924) DTBOUSEL5 Register */
  __IO uint32_t DTBOUTSEL6;                        /* !< (@ 0x00001928) DTBOUSEL6 Register */
  __IO uint32_t DTBOUTSEL7;                        /* !< (@ 0x0000192C) DTBOUSEL7 Register */
       uint32_t RESERVED2[24];
  __IO uint32_t DTBDIR0;                           /* !< (@ 0x00001990) DTBDIR Register */
  __IO uint32_t DTBDIR1;                           /* !< (@ 0x00001994) DTBDIR Register */
  __IO uint32_t DTBDIR2;                           /* !< (@ 0x00001998) DTBDIR Register */
  __IO uint32_t DTBDIR3;                           /* !< (@ 0x0000199C) DTBDIR Register */
  __IO uint32_t DTBDIR4;                           /* !< (@ 0x000019A0) DTBDIR Register */
  __IO uint32_t DTBDIR5;                           /* !< (@ 0x000019A4) DTBDIR Register */
  __IO uint32_t DTBDIR6;                           /* !< (@ 0x000019A8) DTBDIR Register */
  __IO uint32_t DTBDIR7;                           /* !< (@ 0x000019AC) DTBDIR Register */
} IOMUX_M33C1_UNASSIGNED_MMR_REGION_Regs;

/*@}*/ /* end of group IOMUX_M33C1_UNASSIGNED_MMR_REGION */

/** @addtogroup IOMUX_M33C1_SECCFG_MMR_REGION
  @{
*/

typedef struct {
       uint32_t RESERVED0;
  __IO uint32_t PINCM1;                            /* !< (@ 0x00000004) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM2;                            /* !< (@ 0x00000008) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM3;                            /* !< (@ 0x0000000C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM4;                            /* !< (@ 0x00000010) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM5;                            /* !< (@ 0x00000014) Pin Control Management Register in SECCFG region */
       uint32_t RESERVED1;
  __IO uint32_t PINCM7;                            /* !< (@ 0x0000001C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM8;                            /* !< (@ 0x00000020) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM9;                            /* !< (@ 0x00000024) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM10;                           /* !< (@ 0x00000028) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM11;                           /* !< (@ 0x0000002C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM12;                           /* !< (@ 0x00000030) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM13;                           /* !< (@ 0x00000034) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM14;                           /* !< (@ 0x00000038) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM15;                           /* !< (@ 0x0000003C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM16;                           /* !< (@ 0x00000040) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM17;                           /* !< (@ 0x00000044) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM18;                           /* !< (@ 0x00000048) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM19;                           /* !< (@ 0x0000004C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM20;                           /* !< (@ 0x00000050) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM21;                           /* !< (@ 0x00000054) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM22;                           /* !< (@ 0x00000058) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM23;                           /* !< (@ 0x0000005C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM24;                           /* !< (@ 0x00000060) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM25;                           /* !< (@ 0x00000064) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM26;                           /* !< (@ 0x00000068) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM27;                           /* !< (@ 0x0000006C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM28;                           /* !< (@ 0x00000070) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM29;                           /* !< (@ 0x00000074) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM30;                           /* !< (@ 0x00000078) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM31;                           /* !< (@ 0x0000007C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM32;                           /* !< (@ 0x00000080) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM33;                           /* !< (@ 0x00000084) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM34;                           /* !< (@ 0x00000088) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM35;                           /* !< (@ 0x0000008C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM36;                           /* !< (@ 0x00000090) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM37;                           /* !< (@ 0x00000094) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM38;                           /* !< (@ 0x00000098) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM39;                           /* !< (@ 0x0000009C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM40;                           /* !< (@ 0x000000A0) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM41;                           /* !< (@ 0x000000A4) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM42;                           /* !< (@ 0x000000A8) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM43;                           /* !< (@ 0x000000AC) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM44;                           /* !< (@ 0x000000B0) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM45;                           /* !< (@ 0x000000B4) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM46;                           /* !< (@ 0x000000B8) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM47;                           /* !< (@ 0x000000BC) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM48;                           /* !< (@ 0x000000C0) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM49;                           /* !< (@ 0x000000C4) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM50;                           /* !< (@ 0x000000C8) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM51;                           /* !< (@ 0x000000CC) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM52;                           /* !< (@ 0x000000D0) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM53;                           /* !< (@ 0x000000D4) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM54;                           /* !< (@ 0x000000D8) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM55;                           /* !< (@ 0x000000DC) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM56;                           /* !< (@ 0x000000E0) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM57;                           /* !< (@ 0x000000E4) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM58;                           /* !< (@ 0x000000E8) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM59;                           /* !< (@ 0x000000EC) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM60;                           /* !< (@ 0x000000F0) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM61;                           /* !< (@ 0x000000F4) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM62;                           /* !< (@ 0x000000F8) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM63;                           /* !< (@ 0x000000FC) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM64;                           /* !< (@ 0x00000100) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM65;                           /* !< (@ 0x00000104) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM66;                           /* !< (@ 0x00000108) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM67;                           /* !< (@ 0x0000010C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM68;                           /* !< (@ 0x00000110) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM69;                           /* !< (@ 0x00000114) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM70;                           /* !< (@ 0x00000118) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM71;                           /* !< (@ 0x0000011C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM72;                           /* !< (@ 0x00000120) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM73;                           /* !< (@ 0x00000124) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM74;                           /* !< (@ 0x00000128) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM75;                           /* !< (@ 0x0000012C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM76;                           /* !< (@ 0x00000130) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM77;                           /* !< (@ 0x00000134) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM78;                           /* !< (@ 0x00000138) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM79;                           /* !< (@ 0x0000013C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM80;                           /* !< (@ 0x00000140) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM81;                           /* !< (@ 0x00000144) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM82;                           /* !< (@ 0x00000148) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM83;                           /* !< (@ 0x0000014C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM84;                           /* !< (@ 0x00000150) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM85;                           /* !< (@ 0x00000154) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM86;                           /* !< (@ 0x00000158) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM87;                           /* !< (@ 0x0000015C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM88;                           /* !< (@ 0x00000160) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM89;                           /* !< (@ 0x00000164) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM90;                           /* !< (@ 0x00000168) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM91;                           /* !< (@ 0x0000016C) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM92;                           /* !< (@ 0x00000170) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM93;                           /* !< (@ 0x00000174) Pin Control Management Register in SECCFG region */
  __IO uint32_t PINCM94;                           /* !< (@ 0x00000178) Pin Control Management Register in SECCFG region */
} IOMUX_M33C1_SECCFG_MMR_REGION_Regs;

