TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/*@}*/ /* end of group IOMUX_M33C1_SECCFG_MMR_REGION */

/** @addtogroup IOMUX_M33C1
  @{
*/

typedef struct {
  IOMUX_M33C1_SECCFG_MMR_REGION_Regs  SECCFG_MMR_REGION;                 /* !< (@ 0x00000000) SECCFG register region */
       uint32_t RESERVED0[929];
  IOMUX_M33C1_UNASSIGNED_MMR_REGION_Regs  UNASSIGNED_MMR_REGION;             /* !< (@ 0x00001000) UNASSIGNED register region */
} IOMUX_M33C1_Regs;

/*@}*/ /* end of group IOMUX_M33C1 */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

/******************************************************************************
* IOMUX_M33C1 Register Control Bits
******************************************************************************/

/* IOMUX_M33C1_DTBENA Bits */
/* IOMUX_M33C1_DTBENA[ENABLE] Bits */
#define IOMUX_M33C1_DTBENA_ENABLE_OFS            (0)                             /* !< ENABLE Offset */
#define IOMUX_M33C1_DTBENA_ENABLE_MASK           ((uint32_t)0x000000FFU)         /* !< Enable bits */

/* IOMUX_M33C1_DTBBUSSEL Bits */
/* IOMUX_M33C1_DTBBUSSEL[SEL] Bits */
#define IOMUX_M33C1_DTBBUSSEL_SEL_OFS            (0)                             /* !< SEL Offset */
#define IOMUX_M33C1_DTBBUSSEL_SEL_MASK           ((uint32_t)0x00000001U)         /* !< DTB mode select */

/* IOMUX_M33C1_DTBOUTSEL0 Bits */
/* IOMUX_M33C1_DTBOUTSEL0[SELECT] Bits */
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_OFS        (0)                             /* !< SELECT Offset */
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_MASK       ((uint32_t)0x0000007FU)         /* !< Select bits */
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_NONE       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_TRNG       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_LFSS       ((uint32_t)0x00000002U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPIO0      ((uint32_t)0x00000003U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPIO1      ((uint32_t)0x00000004U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPIO2      ((uint32_t)0x00000005U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_ADCMODEL_M33_WRAP0 ((uint32_t)0x00000006U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_ADCMODEL_M33_WRAP1 ((uint32_t)0x00000007U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_WUC        ((uint32_t)0x00000008U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_I2S0       ((uint32_t)0x00000009U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_I2S1       ((uint32_t)0x0000000AU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPTIMER16BADV4CC1 ((uint32_t)0x0000000BU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPTIMER16BADV4CC0 ((uint32_t)0x0000000CU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPTIMER16B2CCLP0 ((uint32_t)0x0000000DU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPTIMER16B2CCLP1 ((uint32_t)0x0000000EU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPTIMER16B2CCLP2 ((uint32_t)0x0000000FU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPTIMER16B2CCLP3 ((uint32_t)0x00000010U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPTIMER16B2CCQEILP0 ((uint32_t)0x00000011U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPTIMER16B2CCQEILP1 ((uint32_t)0x00000012U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_GPTIMER32B2CC0 ((uint32_t)0x00000013U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_NVMNW      ((uint32_t)0x00000014U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_QSPI       ((uint32_t)0x00000015U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_SYSCTL     ((uint32_t)0x00000016U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_ANACOMP0   ((uint32_t)0x00000017U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_SPGSS0     ((uint32_t)0x00000018U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_SPGSS1     ((uint32_t)0x00000019U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_SPGSS2     ((uint32_t)0x0000001AU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_MCPUSS     ((uint32_t)0x0000001BU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_MCAN0      ((uint32_t)0x0000001CU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_MCAN1      ((uint32_t)0x0000001DU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_DMA0       ((uint32_t)0x0000001EU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_DMA1       ((uint32_t)0x0000001FU)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_ANACOMP1   ((uint32_t)0x00000020U)
#define IOMUX_M33C1_DTBOUTSEL0_SELECT_FRI        ((uint32_t)0x00000021U)

/* IOMUX_M33C1_DTBOUTSEL1 Bits */
/* IOMUX_M33C1_DTBOUTSEL1[SELECT] Bits */
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_OFS        (0)                             /* !< SELECT Offset */
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_MASK       ((uint32_t)0x0000007FU)         /* !< Select bits */
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_NONE       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_TRNG       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_LFSS       ((uint32_t)0x00000002U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPIO0      ((uint32_t)0x00000003U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPIO1      ((uint32_t)0x00000004U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPIO2      ((uint32_t)0x00000005U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_ADCMODEL_M33_WRAP0 ((uint32_t)0x00000006U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_ADCMODEL_M33_WRAP1 ((uint32_t)0x00000007U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_WUC        ((uint32_t)0x00000008U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_I2S0       ((uint32_t)0x00000009U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_I2S1       ((uint32_t)0x0000000AU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPTIMER16BADV4CC1 ((uint32_t)0x0000000BU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPTIMER16BADV4CC0 ((uint32_t)0x0000000CU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPTIMER16B2CCLP0 ((uint32_t)0x0000000DU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPTIMER16B2CCLP1 ((uint32_t)0x0000000EU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPTIMER16B2CCLP2 ((uint32_t)0x0000000FU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPTIMER16B2CCLP3 ((uint32_t)0x00000010U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPTIMER16B2CCQEILP0 ((uint32_t)0x00000011U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPTIMER16B2CCQEILP1 ((uint32_t)0x00000012U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_GPTIMER32B2CC0 ((uint32_t)0x00000013U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_NVMNW      ((uint32_t)0x00000014U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_QSPI       ((uint32_t)0x00000015U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_SYSCTL     ((uint32_t)0x00000016U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_ANACOMP0   ((uint32_t)0x00000017U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_SPGSS0     ((uint32_t)0x00000018U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_SPGSS1     ((uint32_t)0x00000019U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_SPGSS2     ((uint32_t)0x0000001AU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_MCPUSS     ((uint32_t)0x0000001BU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_MCAN0      ((uint32_t)0x0000001CU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_MCAN1      ((uint32_t)0x0000001DU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_DMA0       ((uint32_t)0x0000001EU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_DMA1       ((uint32_t)0x0000001FU)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_ANACOMP1   ((uint32_t)0x00000020U)
#define IOMUX_M33C1_DTBOUTSEL1_SELECT_FRI        ((uint32_t)0x00000021U)

/* IOMUX_M33C1_DTBOUTSEL2 Bits */
/* IOMUX_M33C1_DTBOUTSEL2[SELECT] Bits */
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_OFS        (0)                             /* !< SELECT Offset */
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_MASK       ((uint32_t)0x0000007FU)         /* !< Select bits */
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_NONE       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_TRNG       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_LFSS       ((uint32_t)0x00000002U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPIO0      ((uint32_t)0x00000003U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPIO1      ((uint32_t)0x00000004U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPIO2      ((uint32_t)0x00000005U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_ADCMODEL_M33_WRAP0 ((uint32_t)0x00000006U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_ADCMODEL_M33_WRAP1 ((uint32_t)0x00000007U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_WUC        ((uint32_t)0x00000008U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_I2S0       ((uint32_t)0x00000009U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_I2S1       ((uint32_t)0x0000000AU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPTIMER16BADV4CC1 ((uint32_t)0x0000000BU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPTIMER16BADV4CC0 ((uint32_t)0x0000000CU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPTIMER16B2CCLP0 ((uint32_t)0x0000000DU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPTIMER16B2CCLP1 ((uint32_t)0x0000000EU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPTIMER16B2CCLP2 ((uint32_t)0x0000000FU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPTIMER16B2CCLP3 ((uint32_t)0x00000010U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPTIMER16B2CCQEILP0 ((uint32_t)0x00000011U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPTIMER16B2CCQEILP1 ((uint32_t)0x00000012U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_GPTIMER32B2CC0 ((uint32_t)0x00000013U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_NVMNW      ((uint32_t)0x00000014U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_QSPI       ((uint32_t)0x00000015U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_SYSCTL     ((uint32_t)0x00000016U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_ANACOMP0   ((uint32_t)0x00000017U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_SPGSS0     ((uint32_t)0x00000018U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_SPGSS1     ((uint32_t)0x00000019U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_SPGSS2     ((uint32_t)0x0000001AU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_MCPUSS     ((uint32_t)0x0000001BU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_MCAN0      ((uint32_t)0x0000001CU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_MCAN1      ((uint32_t)0x0000001DU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_DMA0       ((uint32_t)0x0000001EU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_DMA1       ((uint32_t)0x0000001FU)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_ANACOMP1   ((uint32_t)0x00000020U)
#define IOMUX_M33C1_DTBOUTSEL2_SELECT_FRI        ((uint32_t)0x00000021U)

