TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_DTBOUTSEL7 Bits */
/* IOMUX_M33C1_DTBOUTSEL7[SELECT] Bits */
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_OFS        (0)                             /* !< SELECT Offset */
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_MASK       ((uint32_t)0x0000007FU)         /* !< Select bits */
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_NONE       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_TRNG       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_LFSS       ((uint32_t)0x00000002U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPIO0      ((uint32_t)0x00000003U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPIO1      ((uint32_t)0x00000004U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPIO2      ((uint32_t)0x00000005U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_ADCMODEL_M33_WRAP0 ((uint32_t)0x00000006U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_ADCMODEL_M33_WRAP1 ((uint32_t)0x00000007U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_WUC        ((uint32_t)0x00000008U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_I2S0       ((uint32_t)0x00000009U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_I2S1       ((uint32_t)0x0000000AU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPTIMER16BADV4CC1 ((uint32_t)0x0000000BU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPTIMER16BADV4CC0 ((uint32_t)0x0000000CU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPTIMER16B2CCLP0 ((uint32_t)0x0000000DU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPTIMER16B2CCLP1 ((uint32_t)0x0000000EU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPTIMER16B2CCLP2 ((uint32_t)0x0000000FU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPTIMER16B2CCLP3 ((uint32_t)0x00000010U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPTIMER16B2CCQEILP0 ((uint32_t)0x00000011U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPTIMER16B2CCQEILP1 ((uint32_t)0x00000012U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_GPTIMER32B2CC0 ((uint32_t)0x00000013U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_NVMNW      ((uint32_t)0x00000014U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_QSPI       ((uint32_t)0x00000015U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_SYSCTL     ((uint32_t)0x00000016U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_ANACOMP0   ((uint32_t)0x00000017U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_SPGSS0     ((uint32_t)0x00000018U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_SPGSS1     ((uint32_t)0x00000019U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_SPGSS2     ((uint32_t)0x0000001AU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_MCPUSS     ((uint32_t)0x0000001BU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_MCAN0      ((uint32_t)0x0000001CU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_MCAN1      ((uint32_t)0x0000001DU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_DMA0       ((uint32_t)0x0000001EU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_DMA1       ((uint32_t)0x0000001FU)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_ANACOMP1   ((uint32_t)0x00000020U)
#define IOMUX_M33C1_DTBOUTSEL7_SELECT_FRI        ((uint32_t)0x00000021U)

/* IOMUX_M33C1_DTBDIR0 Bits */
/* IOMUX_M33C1_DTBDIR0[DIR] Bits */
#define IOMUX_M33C1_DTBDIR0_DIR_OFS              (0)                             /* !< DIR Offset */
#define IOMUX_M33C1_DTBDIR0_DIR_MASK             ((uint32_t)0x00000001U)         /* !< DTB direction bit, 0: DTB OUTPUT
                                                                                    enable, 1: DTB INPUT enable */
#define IOMUX_M33C1_DTBDIR0_DIR_OUT              ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBDIR0_DIR_IN               ((uint32_t)0x00000001U)

/* IOMUX_M33C1_DTBDIR1 Bits */
/* IOMUX_M33C1_DTBDIR1[DIR] Bits */
#define IOMUX_M33C1_DTBDIR1_DIR_OFS              (0)                             /* !< DIR Offset */
#define IOMUX_M33C1_DTBDIR1_DIR_MASK             ((uint32_t)0x00000001U)         /* !< DTB direction bit, 0: DTB OUTPUT
                                                                                    enable, 1: DTB INPUT enable */
#define IOMUX_M33C1_DTBDIR1_DIR_OUT              ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBDIR1_DIR_IN               ((uint32_t)0x00000001U)

/* IOMUX_M33C1_DTBDIR2 Bits */
/* IOMUX_M33C1_DTBDIR2[DIR] Bits */
#define IOMUX_M33C1_DTBDIR2_DIR_OFS              (0)                             /* !< DIR Offset */
#define IOMUX_M33C1_DTBDIR2_DIR_MASK             ((uint32_t)0x00000001U)         /* !< DTB direction bit, 0: DTB OUTPUT
                                                                                    enable, 1: DTB INPUT enable */
#define IOMUX_M33C1_DTBDIR2_DIR_OUT              ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBDIR2_DIR_IN               ((uint32_t)0x00000001U)

/* IOMUX_M33C1_DTBDIR3 Bits */
/* IOMUX_M33C1_DTBDIR3[DIR] Bits */
#define IOMUX_M33C1_DTBDIR3_DIR_OFS              (0)                             /* !< DIR Offset */
#define IOMUX_M33C1_DTBDIR3_DIR_MASK             ((uint32_t)0x00000001U)         /* !< DTB direction bit, 0: DTB OUTPUT
                                                                                    enable, 1: DTB INPUT enable */
#define IOMUX_M33C1_DTBDIR3_DIR_OUT              ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBDIR3_DIR_IN               ((uint32_t)0x00000001U)

/* IOMUX_M33C1_DTBDIR4 Bits */
/* IOMUX_M33C1_DTBDIR4[DIR] Bits */
#define IOMUX_M33C1_DTBDIR4_DIR_OFS              (0)                             /* !< DIR Offset */
#define IOMUX_M33C1_DTBDIR4_DIR_MASK             ((uint32_t)0x00000001U)         /* !< DTB direction bit, 0: DTB OUTPUT
                                                                                    enable, 1: DTB INPUT enable */
#define IOMUX_M33C1_DTBDIR4_DIR_OUT              ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBDIR4_DIR_IN               ((uint32_t)0x00000001U)

/* IOMUX_M33C1_DTBDIR5 Bits */
/* IOMUX_M33C1_DTBDIR5[DIR] Bits */
#define IOMUX_M33C1_DTBDIR5_DIR_OFS              (0)                             /* !< DIR Offset */
#define IOMUX_M33C1_DTBDIR5_DIR_MASK             ((uint32_t)0x00000001U)         /* !< DTB direction bit, 0: DTB OUTPUT
                                                                                    enable, 1: DTB INPUT enable */
#define IOMUX_M33C1_DTBDIR5_DIR_OUT              ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBDIR5_DIR_IN               ((uint32_t)0x00000001U)

