TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_DTBDIR6 Bits */
/* IOMUX_M33C1_DTBDIR6[DIR] Bits */
#define IOMUX_M33C1_DTBDIR6_DIR_OFS              (0)                             /* !< DIR Offset */
#define IOMUX_M33C1_DTBDIR6_DIR_MASK             ((uint32_t)0x00000001U)         /* !< DTB direction bit, 0: DTB OUTPUT
                                                                                    enable, 1: DTB INPUT enable */
#define IOMUX_M33C1_DTBDIR6_DIR_OUT              ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBDIR6_DIR_IN               ((uint32_t)0x00000001U)

/* IOMUX_M33C1_DTBDIR7 Bits */
/* IOMUX_M33C1_DTBDIR7[DIR] Bits */
#define IOMUX_M33C1_DTBDIR7_DIR_OFS              (0)                             /* !< DIR Offset */
#define IOMUX_M33C1_DTBDIR7_DIR_MASK             ((uint32_t)0x00000001U)         /* !< DTB direction bit, 0: DTB OUTPUT
                                                                                    enable, 1: DTB INPUT enable */
#define IOMUX_M33C1_DTBDIR7_DIR_OUT              ((uint32_t)0x00000000U)
#define IOMUX_M33C1_DTBDIR7_DIR_IN               ((uint32_t)0x00000001U)

/* IOMUX_M33C1_PINCM1 Bits */
/* IOMUX_M33C1_PINCM1[WCOMP] Bits */
#define IOMUX_M33C1_PINCM1_WCOMP_OFS             (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM1_WCOMP_MASK            ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM1_WCOMP_MATCH0          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM1_WCOMP_MATCH1          ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM1[WUEN] Bits */
#define IOMUX_M33C1_PINCM1_WUEN_OFS              (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM1_WUEN_MASK             ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM1_WUEN_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM1_WUEN_ENABLE           ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM1[INV] Bits */
#define IOMUX_M33C1_PINCM1_INV_OFS               (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM1_INV_MASK              ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM1_INV_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM1_INV_ENABLE            ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM1[Z1] Bits */
#define IOMUX_M33C1_PINCM1_Z1_OFS                (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM1_Z1_MASK               ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM1_Z1_DISABLE            ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM1_Z1_ENABLE             ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM1[INENA] Bits */
#define IOMUX_M33C1_PINCM1_INENA_OFS             (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM1_INENA_MASK            ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM1_INENA_PADCORE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM1_INENA_CORE0           ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM1[PIPU] Bits */
#define IOMUX_M33C1_PINCM1_PIPU_OFS              (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM1_PIPU_MASK             ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM1_PIPU_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM1_PIPU_ENABLE           ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM1[PIPD] Bits */
#define IOMUX_M33C1_PINCM1_PIPD_OFS              (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM1_PIPD_MASK             ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM1_PIPD_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM1_PIPD_ENABLE           ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM1[WAKESTATE] Bits */
#define IOMUX_M33C1_PINCM1_WAKESTATE_OFS         (13)                            /* !< WAKESTATE Offset */
#define IOMUX_M33C1_PINCM1_WAKESTATE_MASK        ((uint32_t)0x00002000U)         /* !< bit */
/* IOMUX_M33C1_PINCM1[PC] Bits */
#define IOMUX_M33C1_PINCM1_PC_OFS                (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM1_PC_MASK               ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM1_PC_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM1_PC_CONNECTED          ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM1[PF] Bits */
#define IOMUX_M33C1_PINCM1_PF_OFS                (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM1_PF_MASK               ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM1_PF_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM1_PF_GPIO0_DIO00        ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM1_PF_GPTIMER16BADV4CC0_FAULT1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM1_PF_SPGSS0_U1_SDA_TX   ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM1_PF_SPGSS2_U2_SCLK_SCL_RX ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM1_PF_SPGSS1_U4_TX       ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM1_PF_SPGSS1_U2_SDA      ((uint32_t)0x00000006U)

/* IOMUX_M33C1_PINCM2 Bits */
/* IOMUX_M33C1_PINCM2[WCOMP] Bits */
#define IOMUX_M33C1_PINCM2_WCOMP_OFS             (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM2_WCOMP_MASK            ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM2_WCOMP_MATCH0          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM2_WCOMP_MATCH1          ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM2[WUEN] Bits */
#define IOMUX_M33C1_PINCM2_WUEN_OFS              (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM2_WUEN_MASK             ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM2_WUEN_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM2_WUEN_ENABLE           ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM2[INV] Bits */
#define IOMUX_M33C1_PINCM2_INV_OFS               (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM2_INV_MASK              ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM2_INV_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM2_INV_ENABLE            ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM2[Z1] Bits */
#define IOMUX_M33C1_PINCM2_Z1_OFS                (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM2_Z1_MASK               ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM2_Z1_DISABLE            ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM2_Z1_ENABLE             ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM2[INENA] Bits */
#define IOMUX_M33C1_PINCM2_INENA_OFS             (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM2_INENA_MASK            ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM2_INENA_PADCORE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM2_INENA_CORE0           ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM2[PIPU] Bits */
#define IOMUX_M33C1_PINCM2_PIPU_OFS              (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM2_PIPU_MASK             ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM2_PIPU_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM2_PIPU_ENABLE           ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM2[PIPD] Bits */
#define IOMUX_M33C1_PINCM2_PIPD_OFS              (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM2_PIPD_MASK             ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM2_PIPD_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM2_PIPD_ENABLE           ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM2[WAKESTATE] Bits */
#define IOMUX_M33C1_PINCM2_WAKESTATE_OFS         (13)                            /* !< WAKESTATE Offset */
#define IOMUX_M33C1_PINCM2_WAKESTATE_MASK        ((uint32_t)0x00002000U)         /* !< bit */
/* IOMUX_M33C1_PINCM2[PC] Bits */
#define IOMUX_M33C1_PINCM2_PC_OFS                (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM2_PC_MASK               ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM2_PC_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM2_PC_CONNECTED          ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM2[PF] Bits */
#define IOMUX_M33C1_PINCM2_PF_OFS                (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM2_PF_MASK               ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM2_PF_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM2_PF_GPIO0_DIO01        ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM2_PF_GPTIMER16BADV4CC1_FAULT0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM2_PF_SPGSS0_U1_SCL_RX   ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM2_PF_SPGSS2_U2_PICO_SDA_TX ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM2_PF_SPGSS1_U4_RX       ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM2_PF_SPGSS1_U2_SCL      ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM2_PF_GPTIMER16B2CCQEILP0_IDX ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM2_PF_GPTIMER16BADV4CC0_CCP1 ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM3 Bits */
/* IOMUX_M33C1_PINCM3[WCOMP] Bits */
#define IOMUX_M33C1_PINCM3_WCOMP_OFS             (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM3_WCOMP_MASK            ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM3_WCOMP_MATCH0          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM3_WCOMP_MATCH1          ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM3[WUEN] Bits */
#define IOMUX_M33C1_PINCM3_WUEN_OFS              (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM3_WUEN_MASK             ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM3_WUEN_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM3_WUEN_ENABLE           ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM3[INV] Bits */
#define IOMUX_M33C1_PINCM3_INV_OFS               (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM3_INV_MASK              ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM3_INV_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM3_INV_ENABLE            ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM3[Z1] Bits */
#define IOMUX_M33C1_PINCM3_Z1_OFS                (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM3_Z1_MASK               ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM3_Z1_DISABLE            ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM3_Z1_ENABLE             ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM3[DRV] Bits */
#define IOMUX_M33C1_PINCM3_DRV_OFS               (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM3_DRV_MASK              ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM3_DRV_DRIVEVALUE0       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM3_DRV_DRIVEVALUE1       ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM3[INENA] Bits */
#define IOMUX_M33C1_PINCM3_INENA_OFS             (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM3_INENA_MASK            ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM3_INENA_PADCORE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM3_INENA_CORE0           ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM3[PIPU] Bits */
#define IOMUX_M33C1_PINCM3_PIPU_OFS              (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM3_PIPU_MASK             ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM3_PIPU_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM3_PIPU_ENABLE           ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM3[PIPD] Bits */
#define IOMUX_M33C1_PINCM3_PIPD_OFS              (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM3_PIPD_MASK             ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM3_PIPD_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM3_PIPD_ENABLE           ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM3[WAKESTATE] Bits */
#define IOMUX_M33C1_PINCM3_WAKESTATE_OFS         (13)                            /* !< WAKESTATE Offset */
#define IOMUX_M33C1_PINCM3_WAKESTATE_MASK        ((uint32_t)0x00002000U)         /* !< bit */
/* IOMUX_M33C1_PINCM3[PC] Bits */
#define IOMUX_M33C1_PINCM3_PC_OFS                (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM3_PC_MASK               ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM3_PC_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM3_PC_CONNECTED          ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM3[PF] Bits */
#define IOMUX_M33C1_PINCM3_PF_OFS                (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM3_PF_MASK               ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM3_PF_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM3_PF_GPIO0_DIO28        ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM3_PF_GPTIMER16BADV4CC0_FAULT0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM3_PF_SPGSS0_U1_SDA_TX   ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM3_PF_SPGSS2_U2_CS0_CTS  ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM3_PF_SPGSS1_U4_TX       ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM3_PF_SPGSS1_U2_SDA      ((uint32_t)0x00000006U)

/* IOMUX_M33C1_PINCM4 Bits */
/* IOMUX_M33C1_PINCM4[WCOMP] Bits */
#define IOMUX_M33C1_PINCM4_WCOMP_OFS             (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM4_WCOMP_MASK            ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM4_WCOMP_MATCH0          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM4_WCOMP_MATCH1          ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM4[WUEN] Bits */
#define IOMUX_M33C1_PINCM4_WUEN_OFS              (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM4_WUEN_MASK             ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM4_WUEN_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM4_WUEN_ENABLE           ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM4[INV] Bits */
#define IOMUX_M33C1_PINCM4_INV_OFS               (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM4_INV_MASK              ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM4_INV_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM4_INV_ENABLE            ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM4[Z1] Bits */
#define IOMUX_M33C1_PINCM4_Z1_OFS                (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM4_Z1_MASK               ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM4_Z1_DISABLE            ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM4_Z1_ENABLE             ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM4[INENA] Bits */
#define IOMUX_M33C1_PINCM4_INENA_OFS             (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM4_INENA_MASK            ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM4_INENA_PADCORE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM4_INENA_CORE0           ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM4[PIPU] Bits */
#define IOMUX_M33C1_PINCM4_PIPU_OFS              (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM4_PIPU_MASK             ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM4_PIPU_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM4_PIPU_ENABLE           ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM4[PIPD] Bits */
#define IOMUX_M33C1_PINCM4_PIPD_OFS              (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM4_PIPD_MASK             ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM4_PIPD_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM4_PIPD_ENABLE           ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM4[PC] Bits */
#define IOMUX_M33C1_PINCM4_PC_OFS                (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM4_PC_MASK               ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM4_PC_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM4_PC_CONNECTED          ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM4[PF] Bits */
#define IOMUX_M33C1_PINCM4_PF_OFS                (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM4_PF_MASK               ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM4_PF_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM4_PF_GPIO0_DIO29        ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM4_PF_GPTIMER16B2CCLP2_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM4_PF_GPTIMER16BADV4CC1_FAULT1 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM4_PF_SPGSS2_U2_POCI_RTS ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM4_PF_SPGSS1_U4_RTS      ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM4_PF_SPGSS0_U2_SCL_RX   ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM4_PF_SPGSS1_U3_SCL      ((uint32_t)0x00000007U)

/* IOMUX_M33C1_PINCM5 Bits */
/* IOMUX_M33C1_PINCM5[WCOMP] Bits */
#define IOMUX_M33C1_PINCM5_WCOMP_OFS             (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM5_WCOMP_MASK            ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM5_WCOMP_MATCH0          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM5_WCOMP_MATCH1          ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM5[WUEN] Bits */
#define IOMUX_M33C1_PINCM5_WUEN_OFS              (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM5_WUEN_MASK             ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM5_WUEN_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM5_WUEN_ENABLE           ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM5[INV] Bits */
#define IOMUX_M33C1_PINCM5_INV_OFS               (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM5_INV_MASK              ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM5_INV_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM5_INV_ENABLE            ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM5[Z1] Bits */
#define IOMUX_M33C1_PINCM5_Z1_OFS                (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM5_Z1_MASK               ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM5_Z1_DISABLE            ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM5_Z1_ENABLE             ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM5[INENA] Bits */
#define IOMUX_M33C1_PINCM5_INENA_OFS             (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM5_INENA_MASK            ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM5_INENA_PADCORE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM5_INENA_CORE0           ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM5[PIPU] Bits */
#define IOMUX_M33C1_PINCM5_PIPU_OFS              (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM5_PIPU_MASK             ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM5_PIPU_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM5_PIPU_ENABLE           ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM5[PIPD] Bits */
#define IOMUX_M33C1_PINCM5_PIPD_OFS              (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM5_PIPD_MASK             ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM5_PIPD_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM5_PIPD_ENABLE           ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM5[PC] Bits */
#define IOMUX_M33C1_PINCM5_PC_OFS                (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM5_PC_MASK               ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM5_PC_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM5_PC_CONNECTED          ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM5[PF] Bits */
#define IOMUX_M33C1_PINCM5_PF_OFS                (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM5_PF_MASK               ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM5_PF_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM5_PF_GPIO0_DIO30        ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM5_PF_GPTIMER16B2CCLP2_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM5_PF_GPTIMER16BADV4CC0_FAULT2 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM5_PF_SPGSS1_U4_CTS      ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM5_PF_SPGSS0_U2_SDA_TX   ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM5_PF_SPGSS1_U3_SDA      ((uint32_t)0x00000007U)

