TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM7 Bits */
/* IOMUX_M33C1_PINCM7[WCOMP] Bits */
#define IOMUX_M33C1_PINCM7_WCOMP_OFS             (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM7_WCOMP_MASK            ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM7_WCOMP_MATCH0          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM7_WCOMP_MATCH1          ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM7[WUEN] Bits */
#define IOMUX_M33C1_PINCM7_WUEN_OFS              (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM7_WUEN_MASK             ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM7_WUEN_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM7_WUEN_ENABLE           ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM7[INV] Bits */
#define IOMUX_M33C1_PINCM7_INV_OFS               (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM7_INV_MASK              ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM7_INV_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM7_INV_ENABLE            ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM7[Z1] Bits */
#define IOMUX_M33C1_PINCM7_Z1_OFS                (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM7_Z1_MASK               ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM7_Z1_DISABLE            ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM7_Z1_ENABLE             ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM7[INENA] Bits */
#define IOMUX_M33C1_PINCM7_INENA_OFS             (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM7_INENA_MASK            ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM7_INENA_PADCORE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM7_INENA_CORE0           ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM7[PIPU] Bits */
#define IOMUX_M33C1_PINCM7_PIPU_OFS              (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM7_PIPU_MASK             ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM7_PIPU_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM7_PIPU_ENABLE           ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM7[PIPD] Bits */
#define IOMUX_M33C1_PINCM7_PIPD_OFS              (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM7_PIPD_MASK             ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM7_PIPD_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM7_PIPD_ENABLE           ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM7[PC] Bits */
#define IOMUX_M33C1_PINCM7_PC_OFS                (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM7_PC_MASK               ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM7_PC_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM7_PC_CONNECTED          ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM7[PF] Bits */
#define IOMUX_M33C1_PINCM7_PF_OFS                (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM7_PF_MASK               ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM7_PF_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM7_PF_GPIO0_DIO02        ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM7_PF_GPTIMER16B2CCQEILP0_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM7_PF_GPTIMER16BADV4CC0_CCP1 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM7_PF_SPGSS1_U4_RX       ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM7_PF_SPGSS1_U0_CS0      ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM7_PF_SPGSS2_U0_POCI_RTS ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM7_PF_SPGSS2_U2_POCI_RTS ((uint32_t)0x00000007U)

/* IOMUX_M33C1_PINCM8 Bits */
/* IOMUX_M33C1_PINCM8[WCOMP] Bits */
#define IOMUX_M33C1_PINCM8_WCOMP_OFS             (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM8_WCOMP_MASK            ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM8_WCOMP_MATCH0          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM8_WCOMP_MATCH1          ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM8[WUEN] Bits */
#define IOMUX_M33C1_PINCM8_WUEN_OFS              (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM8_WUEN_MASK             ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM8_WUEN_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM8_WUEN_ENABLE           ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM8[INV] Bits */
#define IOMUX_M33C1_PINCM8_INV_OFS               (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM8_INV_MASK              ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM8_INV_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM8_INV_ENABLE            ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM8[Z1] Bits */
#define IOMUX_M33C1_PINCM8_Z1_OFS                (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM8_Z1_MASK               ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM8_Z1_DISABLE            ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM8_Z1_ENABLE             ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM8[INENA] Bits */
#define IOMUX_M33C1_PINCM8_INENA_OFS             (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM8_INENA_MASK            ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM8_INENA_PADCORE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM8_INENA_CORE0           ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM8[PIPU] Bits */
#define IOMUX_M33C1_PINCM8_PIPU_OFS              (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM8_PIPU_MASK             ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM8_PIPU_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM8_PIPU_ENABLE           ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM8[PIPD] Bits */
#define IOMUX_M33C1_PINCM8_PIPD_OFS              (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM8_PIPD_MASK             ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM8_PIPD_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM8_PIPD_ENABLE           ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM8[PC] Bits */
#define IOMUX_M33C1_PINCM8_PC_OFS                (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM8_PC_MASK               ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM8_PC_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM8_PC_CONNECTED          ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM8[PF] Bits */
#define IOMUX_M33C1_PINCM8_PF_OFS                (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM8_PF_MASK               ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM8_PF_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM8_PF_GPIO0_DIO03        ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM8_PF_GPTIMER16B2CCQEILP0_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM8_PF_GPTIMER16BADV4CC0_CCP1 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM8_PF_SPGSS0_U2_SDA_TX   ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM8_PF_SPGSS1_U0_CS1      ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM8_PF_ANACOMP1_OUT       ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM8_PF_SPGSS1_U3_SDA      ((uint32_t)0x00000007U)

/* IOMUX_M33C1_PINCM9 Bits */
/* IOMUX_M33C1_PINCM9[WCOMP] Bits */
#define IOMUX_M33C1_PINCM9_WCOMP_OFS             (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM9_WCOMP_MASK            ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM9_WCOMP_MATCH0          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM9_WCOMP_MATCH1          ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM9[WUEN] Bits */
#define IOMUX_M33C1_PINCM9_WUEN_OFS              (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM9_WUEN_MASK             ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM9_WUEN_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM9_WUEN_ENABLE           ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM9[INV] Bits */
#define IOMUX_M33C1_PINCM9_INV_OFS               (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM9_INV_MASK              ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM9_INV_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM9_INV_ENABLE            ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM9[Z1] Bits */
#define IOMUX_M33C1_PINCM9_Z1_OFS                (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM9_Z1_MASK               ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM9_Z1_DISABLE            ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM9_Z1_ENABLE             ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM9[INENA] Bits */
#define IOMUX_M33C1_PINCM9_INENA_OFS             (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM9_INENA_MASK            ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM9_INENA_PADCORE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM9_INENA_CORE0           ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM9[PIPU] Bits */
#define IOMUX_M33C1_PINCM9_PIPU_OFS              (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM9_PIPU_MASK             ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM9_PIPU_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM9_PIPU_ENABLE           ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM9[PIPD] Bits */
#define IOMUX_M33C1_PINCM9_PIPD_OFS              (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM9_PIPD_MASK             ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM9_PIPD_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM9_PIPD_ENABLE           ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM9[PC] Bits */
#define IOMUX_M33C1_PINCM9_PC_OFS                (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM9_PC_MASK               ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM9_PC_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM9_PC_CONNECTED          ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM9[PF] Bits */
#define IOMUX_M33C1_PINCM9_PF_OFS                (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM9_PF_MASK               ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM9_PF_UNCONNECTED        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM9_PF_GPIO0_DIO04        ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM9_PF_SYSCTL_LFCLKIN     ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM9_PF_GPTIMER16BADV4CC0_CCP1_CMPL ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM9_PF_SPGSS0_U2_SCL_RX   ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM9_PF_SPGSS1_U0_POCI     ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM9_PF_SPGSS2_U0_CS0_CTS  ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM9_PF_SPGSS1_U3_SCL      ((uint32_t)0x00000007U)

