TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM10 Bits */
/* IOMUX_M33C1_PINCM10[WCOMP] Bits */
#define IOMUX_M33C1_PINCM10_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM10_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM10_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM10_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM10[WUEN] Bits */
#define IOMUX_M33C1_PINCM10_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM10_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM10_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM10_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM10[INV] Bits */
#define IOMUX_M33C1_PINCM10_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM10_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM10_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM10_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM10[Z1] Bits */
#define IOMUX_M33C1_PINCM10_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM10_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM10_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM10_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM10[INENA] Bits */
#define IOMUX_M33C1_PINCM10_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM10_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM10_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM10_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM10[PIPU] Bits */
#define IOMUX_M33C1_PINCM10_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM10_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM10_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM10_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM10[PIPD] Bits */
#define IOMUX_M33C1_PINCM10_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM10_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM10_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM10_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM10[PC] Bits */
#define IOMUX_M33C1_PINCM10_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM10_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM10_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM10_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM10[PF] Bits */
#define IOMUX_M33C1_PINCM10_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM10_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM10_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM10_PF_GPIO0_DIO05       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM10_PF_GPTIMER16B2CCLP2_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM10_PF_GPTIMER16B2CCLP0_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM10_PF_SPGSS1_U0_PICO    ((uint32_t)0x00000005U)

/* IOMUX_M33C1_PINCM11 Bits */
/* IOMUX_M33C1_PINCM11[WCOMP] Bits */
#define IOMUX_M33C1_PINCM11_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM11_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM11_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM11_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM11[WUEN] Bits */
#define IOMUX_M33C1_PINCM11_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM11_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM11_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM11_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM11[INV] Bits */
#define IOMUX_M33C1_PINCM11_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM11_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM11_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM11_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM11[Z1] Bits */
#define IOMUX_M33C1_PINCM11_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM11_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM11_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM11_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM11[INENA] Bits */
#define IOMUX_M33C1_PINCM11_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM11_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM11_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM11_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM11[PIPU] Bits */
#define IOMUX_M33C1_PINCM11_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM11_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM11_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM11_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM11[PIPD] Bits */
#define IOMUX_M33C1_PINCM11_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM11_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM11_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM11_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM11[PC] Bits */
#define IOMUX_M33C1_PINCM11_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM11_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM11_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM11_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM11[PF] Bits */
#define IOMUX_M33C1_PINCM11_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM11_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM11_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM11_PF_GPIO0_DIO06       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM11_PF_GPTIMER16B2CCLP2_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM11_PF_SYSCTL_HFCLKIN    ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM11_PF_GPTIMER16BADV4CC0_CCP2_CMPL ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM11_PF_SPGSS1_U0_SCLK    ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM11_PF_GPTIMER16B2CCLP0_CCP1 ((uint32_t)0x00000006U)

/* IOMUX_M33C1_PINCM12 Bits */
/* IOMUX_M33C1_PINCM12[WCOMP] Bits */
#define IOMUX_M33C1_PINCM12_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM12_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM12_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM12_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM12[WUEN] Bits */
#define IOMUX_M33C1_PINCM12_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM12_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM12_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM12_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM12[INV] Bits */
#define IOMUX_M33C1_PINCM12_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM12_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM12_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM12_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM12[Z1] Bits */
#define IOMUX_M33C1_PINCM12_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM12_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM12_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM12_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM12[INENA] Bits */
#define IOMUX_M33C1_PINCM12_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM12_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM12_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM12_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM12[PIPU] Bits */
#define IOMUX_M33C1_PINCM12_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM12_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM12_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM12_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM12[PIPD] Bits */
#define IOMUX_M33C1_PINCM12_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM12_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM12_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM12_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM12[PC] Bits */
#define IOMUX_M33C1_PINCM12_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM12_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM12_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM12_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM12[PF] Bits */
#define IOMUX_M33C1_PINCM12_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM12_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM12_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM12_PF_GPIO1_DIO00       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM12_PF_SPGSS0_U1_SDA_TX  ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM12_PF_GPTIMER16B2CCLP1_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM12_PF_SPGSS1_U4_TX      ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM12_PF_GPTIMER16BADV4CC1_CCP2 ((uint32_t)0x00000005U)

/* IOMUX_M33C1_PINCM13 Bits */
/* IOMUX_M33C1_PINCM13[WCOMP] Bits */
#define IOMUX_M33C1_PINCM13_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM13_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM13_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM13_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM13[WUEN] Bits */
#define IOMUX_M33C1_PINCM13_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM13_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM13_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM13_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM13[INV] Bits */
#define IOMUX_M33C1_PINCM13_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM13_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM13_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM13_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM13[Z1] Bits */
#define IOMUX_M33C1_PINCM13_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM13_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM13_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM13_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM13[INENA] Bits */
#define IOMUX_M33C1_PINCM13_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM13_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM13_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM13_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM13[PIPU] Bits */
#define IOMUX_M33C1_PINCM13_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM13_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM13_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM13_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM13[PIPD] Bits */
#define IOMUX_M33C1_PINCM13_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM13_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM13_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM13_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM13[PC] Bits */
#define IOMUX_M33C1_PINCM13_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM13_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM13_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM13_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM13[PF] Bits */
#define IOMUX_M33C1_PINCM13_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM13_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM13_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM13_PF_GPIO1_DIO01       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM13_PF_SPGSS0_U1_SCL_RX  ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM13_PF_GPTIMER16B2CCLP1_CCP1 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM13_PF_SPGSS1_U4_RX      ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM13_PF_GPTIMER16BADV4CC1_CCP2_CMPL ((uint32_t)0x00000005U)

