TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM14 Bits */
/* IOMUX_M33C1_PINCM14[WCOMP] Bits */
#define IOMUX_M33C1_PINCM14_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM14_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM14_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM14_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM14[WUEN] Bits */
#define IOMUX_M33C1_PINCM14_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM14_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM14_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM14_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM14[INV] Bits */
#define IOMUX_M33C1_PINCM14_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM14_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM14_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM14_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM14[Z1] Bits */
#define IOMUX_M33C1_PINCM14_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM14_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM14_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM14_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM14[INENA] Bits */
#define IOMUX_M33C1_PINCM14_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM14_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM14_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM14_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM14[PIPU] Bits */
#define IOMUX_M33C1_PINCM14_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM14_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM14_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM14_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM14[PIPD] Bits */
#define IOMUX_M33C1_PINCM14_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM14_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM14_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM14_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM14[PC] Bits */
#define IOMUX_M33C1_PINCM14_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM14_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM14_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM14_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM14[PF] Bits */
#define IOMUX_M33C1_PINCM14_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM14_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM14_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM14_PF_GPIO0_DIO07       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM14_PF_GPTIMER16B2CCLP3_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM14_PF_SYSCTL_CLK_OUT    ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM14_PF_ANACOMP0_OUT      ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM14_PF_GPTIMER16BADV4CC0_CCP2 ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM14_PF_I2S0_WCLK         ((uint32_t)0x00000006U)

/* IOMUX_M33C1_PINCM15 Bits */
/* IOMUX_M33C1_PINCM15[WCOMP] Bits */
#define IOMUX_M33C1_PINCM15_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM15_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM15_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM15_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM15[WUEN] Bits */
#define IOMUX_M33C1_PINCM15_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM15_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM15_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM15_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM15[INV] Bits */
#define IOMUX_M33C1_PINCM15_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM15_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM15_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM15_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM15[Z1] Bits */
#define IOMUX_M33C1_PINCM15_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM15_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM15_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM15_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM15[INENA] Bits */
#define IOMUX_M33C1_PINCM15_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM15_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM15_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM15_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM15[PIPU] Bits */
#define IOMUX_M33C1_PINCM15_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM15_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM15_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM15_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM15[PIPD] Bits */
#define IOMUX_M33C1_PINCM15_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM15_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM15_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM15_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM15[PC] Bits */
#define IOMUX_M33C1_PINCM15_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM15_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM15_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM15_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM15[PF] Bits */
#define IOMUX_M33C1_PINCM15_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM15_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM15_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM15_PF_GPIO1_DIO02       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM15_PF_GPTIMER16B2CCLP2_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM15_PF_GPTIMER16BADV4CC0_CCP3 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM15_PF_SPGSS2_U0_CS0_CTS ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM15_PF_SPGSS0_U2_SCL_RX  ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM15_PF_SPGSS1_U3_SCL     ((uint32_t)0x00000006U)

/* IOMUX_M33C1_PINCM16 Bits */
/* IOMUX_M33C1_PINCM16[WCOMP] Bits */
#define IOMUX_M33C1_PINCM16_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM16_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM16_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM16_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM16[WUEN] Bits */
#define IOMUX_M33C1_PINCM16_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM16_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM16_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM16_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM16[INV] Bits */
#define IOMUX_M33C1_PINCM16_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM16_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM16_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM16_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM16[Z1] Bits */
#define IOMUX_M33C1_PINCM16_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM16_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM16_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM16_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM16[INENA] Bits */
#define IOMUX_M33C1_PINCM16_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM16_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM16_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM16_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM16[PIPU] Bits */
#define IOMUX_M33C1_PINCM16_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM16_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM16_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM16_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM16[PIPD] Bits */
#define IOMUX_M33C1_PINCM16_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM16_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM16_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM16_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM16[PC] Bits */
#define IOMUX_M33C1_PINCM16_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM16_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM16_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM16_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM16[PF] Bits */
#define IOMUX_M33C1_PINCM16_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM16_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM16_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM16_PF_GPIO1_DIO03       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM16_PF_GPTIMER16B2CCLP2_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM16_PF_GPTIMER16BADV4CC0_CCP3_CMPL ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM16_PF_SPGSS2_U0_POCI_RTS ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM16_PF_SPGSS0_U2_SDA_TX  ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM16_PF_SPGSS1_U3_SDA     ((uint32_t)0x00000006U)

/* IOMUX_M33C1_PINCM17 Bits */
/* IOMUX_M33C1_PINCM17[WCOMP] Bits */
#define IOMUX_M33C1_PINCM17_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM17_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM17_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM17_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM17[WUEN] Bits */
#define IOMUX_M33C1_PINCM17_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM17_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM17_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM17_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM17[INV] Bits */
#define IOMUX_M33C1_PINCM17_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM17_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM17_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM17_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM17[Z1] Bits */
#define IOMUX_M33C1_PINCM17_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM17_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM17_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM17_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM17[INENA] Bits */
#define IOMUX_M33C1_PINCM17_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM17_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM17_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM17_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM17[PIPU] Bits */
#define IOMUX_M33C1_PINCM17_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM17_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM17_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM17_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM17[PIPD] Bits */
#define IOMUX_M33C1_PINCM17_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM17_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM17_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM17_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM17[PC] Bits */
#define IOMUX_M33C1_PINCM17_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM17_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM17_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM17_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM17[PF] Bits */
#define IOMUX_M33C1_PINCM17_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM17_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM17_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM17_PF_GPIO1_DIO04       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM17_PF_GPTIMER16BADV4CC0_CCP2 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM17_PF_SPGSS0_U2_SDA_TX  ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM17_PF_SPGSS1_U5_CS0_CTS ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM17_PF_SPGSS2_U0_PICO_SDA_TX ((uint32_t)0x00000005U)

