TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM18 Bits */
/* IOMUX_M33C1_PINCM18[WCOMP] Bits */
#define IOMUX_M33C1_PINCM18_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM18_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM18_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM18_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM18[WUEN] Bits */
#define IOMUX_M33C1_PINCM18_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM18_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM18_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM18_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM18[INV] Bits */
#define IOMUX_M33C1_PINCM18_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM18_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM18_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM18_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM18[Z1] Bits */
#define IOMUX_M33C1_PINCM18_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM18_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM18_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM18_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM18[DRV] Bits */
#define IOMUX_M33C1_PINCM18_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM18_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM18_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM18_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM18[INENA] Bits */
#define IOMUX_M33C1_PINCM18_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM18_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM18_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM18_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM18[PIPU] Bits */
#define IOMUX_M33C1_PINCM18_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM18_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM18_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM18_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM18[PIPD] Bits */
#define IOMUX_M33C1_PINCM18_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM18_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM18_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM18_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM18[PC] Bits */
#define IOMUX_M33C1_PINCM18_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM18_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM18_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM18_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM18[PF] Bits */
#define IOMUX_M33C1_PINCM18_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM18_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM18_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM18_PF_GPIO1_DIO05       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM18_PF_GPTIMER16BADV4CC0_CCP2_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM18_PF_SPGSS0_U2_SCL_RX  ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM18_PF_SPGSS1_U5_POCI_RTS ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM18_PF_SPGSS2_U0_POCI_RTS ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM18_PF_SPGSS1_U0_POCI    ((uint32_t)0x00000006U)

/* IOMUX_M33C1_PINCM19 Bits */
/* IOMUX_M33C1_PINCM19[WCOMP] Bits */
#define IOMUX_M33C1_PINCM19_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM19_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM19_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM19_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM19[WUEN] Bits */
#define IOMUX_M33C1_PINCM19_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM19_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM19_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM19_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM19[INV] Bits */
#define IOMUX_M33C1_PINCM19_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM19_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM19_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM19_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM19[Z1] Bits */
#define IOMUX_M33C1_PINCM19_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM19_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM19_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM19_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM19[DRV] Bits */
#define IOMUX_M33C1_PINCM19_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM19_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM19_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM19_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM19[INENA] Bits */
#define IOMUX_M33C1_PINCM19_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM19_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM19_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM19_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM19[PIPU] Bits */
#define IOMUX_M33C1_PINCM19_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM19_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM19_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM19_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM19[PIPD] Bits */
#define IOMUX_M33C1_PINCM19_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM19_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM19_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM19_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM19[PC] Bits */
#define IOMUX_M33C1_PINCM19_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM19_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM19_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM19_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM19[PF] Bits */
#define IOMUX_M33C1_PINCM19_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM19_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM19_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM19_PF_GPIO0_DIO08       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM19_PF_GPTIMER16BADV4CC0_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM19_PF_GPTIMER16BADV4CC1_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM19_PF_SPGSS0_U1_RTS     ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM19_PF_SPGSS0_U2_SDA_TX  ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM19_PF_SPGSS1_U0_SCLK    ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM19_PF_SPGSS1_U4_RTS     ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM19_PF_I2S0_WCLK         ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM20 Bits */
/* IOMUX_M33C1_PINCM20[WCOMP] Bits */
#define IOMUX_M33C1_PINCM20_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM20_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM20_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM20_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM20[WUEN] Bits */
#define IOMUX_M33C1_PINCM20_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM20_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM20_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM20_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM20[INV] Bits */
#define IOMUX_M33C1_PINCM20_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM20_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM20_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM20_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM20[Z1] Bits */
#define IOMUX_M33C1_PINCM20_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM20_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM20_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM20_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM20[DRV] Bits */
#define IOMUX_M33C1_PINCM20_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM20_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM20_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM20_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM20[INENA] Bits */
#define IOMUX_M33C1_PINCM20_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM20_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM20_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM20_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM20[PIPU] Bits */
#define IOMUX_M33C1_PINCM20_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM20_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM20_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM20_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM20[PIPD] Bits */
#define IOMUX_M33C1_PINCM20_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM20_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM20_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM20_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM20[PC] Bits */
#define IOMUX_M33C1_PINCM20_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM20_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM20_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM20_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM20[PF] Bits */
#define IOMUX_M33C1_PINCM20_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM20_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM20_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM20_PF_GPIO0_DIO09       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM20_PF_GPTIMER16BADV4CC0_CCP0_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM20_PF_LFSS_RTC_OUT      ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM20_PF_SPGSS0_U1_CTS     ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM20_PF_SPGSS0_U2_SCL_RX  ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM20_PF_SPGSS1_U0_PICO    ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM20_PF_SPGSS1_U4_CTS     ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM20_PF_SYSCTL_CLK_OUT    ((uint32_t)0x00000008U)
#define IOMUX_M33C1_PINCM20_PF_I2S0_MCLK         ((uint32_t)0x00000009U)
#define IOMUX_M33C1_PINCM20_PF_DFTSS_TDO         ((uint32_t)0x0000000AU)

