TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM21 Bits */
/* IOMUX_M33C1_PINCM21[WCOMP] Bits */
#define IOMUX_M33C1_PINCM21_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM21_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM21_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM21_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM21[WUEN] Bits */
#define IOMUX_M33C1_PINCM21_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM21_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM21_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM21_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM21[INV] Bits */
#define IOMUX_M33C1_PINCM21_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM21_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM21_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM21_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM21[Z1] Bits */
#define IOMUX_M33C1_PINCM21_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM21_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM21_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM21_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM21[DRV] Bits */
#define IOMUX_M33C1_PINCM21_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM21_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM21_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM21_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM21[INENA] Bits */
#define IOMUX_M33C1_PINCM21_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM21_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM21_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM21_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM21[PIPU] Bits */
#define IOMUX_M33C1_PINCM21_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM21_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM21_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM21_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM21[PIPD] Bits */
#define IOMUX_M33C1_PINCM21_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM21_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM21_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM21_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM21[WAKESTATE] Bits */
#define IOMUX_M33C1_PINCM21_WAKESTATE_OFS        (13)                            /* !< WAKESTATE Offset */
#define IOMUX_M33C1_PINCM21_WAKESTATE_MASK       ((uint32_t)0x00002000U)         /* !< bit */
/* IOMUX_M33C1_PINCM21[PC] Bits */
#define IOMUX_M33C1_PINCM21_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM21_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM21_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM21_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM21[PF] Bits */
#define IOMUX_M33C1_PINCM21_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM21_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM21_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM21_PF_GPIO0_DIO10       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM21_PF_GPTIMER32B2CC0_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM21_PF_GPTIMER16BADV4CC0_CCP2 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM21_PF_SPGSS0_U1_SDA_TX  ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM21_PF_SPGSS1_U0_POCI    ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM21_PF_SPGSS1_U2_SDA     ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM21_PF_SPGSS1_U4_TX      ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM21_PF_SPGSS2_U0_SCLK_SCL_RX ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM22 Bits */
/* IOMUX_M33C1_PINCM22[WCOMP] Bits */
#define IOMUX_M33C1_PINCM22_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM22_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM22_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM22_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM22[WUEN] Bits */
#define IOMUX_M33C1_PINCM22_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM22_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM22_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM22_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM22[INV] Bits */
#define IOMUX_M33C1_PINCM22_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM22_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM22_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM22_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM22[Z1] Bits */
#define IOMUX_M33C1_PINCM22_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM22_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM22_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM22_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM22[DRV] Bits */
#define IOMUX_M33C1_PINCM22_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM22_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM22_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM22_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM22[INENA] Bits */
#define IOMUX_M33C1_PINCM22_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM22_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM22_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM22_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM22[PIPU] Bits */
#define IOMUX_M33C1_PINCM22_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM22_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM22_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM22_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM22[PIPD] Bits */
#define IOMUX_M33C1_PINCM22_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM22_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM22_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM22_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM22[WAKESTATE] Bits */
#define IOMUX_M33C1_PINCM22_WAKESTATE_OFS        (13)                            /* !< WAKESTATE Offset */
#define IOMUX_M33C1_PINCM22_WAKESTATE_MASK       ((uint32_t)0x00002000U)         /* !< bit */
/* IOMUX_M33C1_PINCM22[PC] Bits */
#define IOMUX_M33C1_PINCM22_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM22_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM22_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM22_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM22[PF] Bits */
#define IOMUX_M33C1_PINCM22_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM22_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM22_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM22_PF_GPIO0_DIO11       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM22_PF_GPTIMER16BADV4CC1_CCP0_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM22_PF_GPTIMER16BADV4CC0_CCP2_CMPL ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM22_PF_SPGSS0_U1_SCL_RX  ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM22_PF_SPGSS1_U0_SCLK    ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM22_PF_SPGSS1_U2_SCL     ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM22_PF_SPGSS1_U4_RX      ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM22_PF_ANACOMP0_OUT      ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM23 Bits */
/* IOMUX_M33C1_PINCM23[WCOMP] Bits */
#define IOMUX_M33C1_PINCM23_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM23_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM23_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM23_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM23[WUEN] Bits */
#define IOMUX_M33C1_PINCM23_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM23_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM23_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM23_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM23[INV] Bits */
#define IOMUX_M33C1_PINCM23_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM23_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM23_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM23_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM23[Z1] Bits */
#define IOMUX_M33C1_PINCM23_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM23_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM23_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM23_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM23[DRV] Bits */
#define IOMUX_M33C1_PINCM23_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM23_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM23_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM23_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM23[INENA] Bits */
#define IOMUX_M33C1_PINCM23_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM23_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM23_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM23_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM23[PIPU] Bits */
#define IOMUX_M33C1_PINCM23_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM23_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM23_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM23_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM23[PIPD] Bits */
#define IOMUX_M33C1_PINCM23_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM23_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM23_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM23_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM23[PC] Bits */
#define IOMUX_M33C1_PINCM23_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM23_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM23_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM23_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM23[PF] Bits */
#define IOMUX_M33C1_PINCM23_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM23_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM23_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM23_PF_GPIO1_DIO06       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM23_PF_GPTIMER16B2CCLP2_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM23_PF_GPTIMER16BADV4CC1_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM23_PF_I2S1_AD0          ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM23_PF_SPGSS0_U2_SDA_TX  ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM23_PF_SPGSS1_U4_CTS     ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM23_PF_SPGSS1_U0_CS1     ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM23_PF_MCAN1_CANRX       ((uint32_t)0x00000009U)

/* IOMUX_M33C1_PINCM24 Bits */
/* IOMUX_M33C1_PINCM24[WCOMP] Bits */
#define IOMUX_M33C1_PINCM24_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM24_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM24_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM24_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM24[WUEN] Bits */
#define IOMUX_M33C1_PINCM24_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM24_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM24_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM24_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM24[INV] Bits */
#define IOMUX_M33C1_PINCM24_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM24_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM24_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM24_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM24[Z1] Bits */
#define IOMUX_M33C1_PINCM24_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM24_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM24_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM24_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM24[DRV] Bits */
#define IOMUX_M33C1_PINCM24_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM24_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM24_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM24_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM24[INENA] Bits */
#define IOMUX_M33C1_PINCM24_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM24_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM24_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM24_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM24[PIPU] Bits */
#define IOMUX_M33C1_PINCM24_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM24_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM24_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM24_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM24[PIPD] Bits */
#define IOMUX_M33C1_PINCM24_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM24_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM24_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM24_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM24[PC] Bits */
#define IOMUX_M33C1_PINCM24_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM24_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM24_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM24_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM24[PF] Bits */
#define IOMUX_M33C1_PINCM24_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM24_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM24_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM24_PF_GPIO1_DIO07       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM24_PF_GPTIMER16B2CCLP2_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM24_PF_GPTIMER16B2CCQEILP1_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM24_PF_GPTIMER16BADV4CC1_CCP0_CMPL ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM24_PF_I2S1_AD1          ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM24_PF_SPGSS0_U2_SCL_RX  ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM24_PF_SPGSS1_U4_RTS     ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM24_PF_SPGSS1_U5_POCI_RTS ((uint32_t)0x00000008U)
#define IOMUX_M33C1_PINCM24_PF_MCAN1_CANTX       ((uint32_t)0x00000009U)

