TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM25 Bits */
/* IOMUX_M33C1_PINCM25[WCOMP] Bits */
#define IOMUX_M33C1_PINCM25_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM25_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM25_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM25_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM25[WUEN] Bits */
#define IOMUX_M33C1_PINCM25_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM25_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM25_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM25_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM25[INV] Bits */
#define IOMUX_M33C1_PINCM25_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM25_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM25_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM25_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM25[Z1] Bits */
#define IOMUX_M33C1_PINCM25_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM25_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM25_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM25_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM25[INENA] Bits */
#define IOMUX_M33C1_PINCM25_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM25_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM25_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM25_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM25[PIPU] Bits */
#define IOMUX_M33C1_PINCM25_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM25_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM25_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM25_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM25[PIPD] Bits */
#define IOMUX_M33C1_PINCM25_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM25_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM25_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM25_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM25[PC] Bits */
#define IOMUX_M33C1_PINCM25_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM25_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM25_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM25_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM25[PF] Bits */
#define IOMUX_M33C1_PINCM25_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM25_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM25_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM25_PF_GPIO1_DIO08       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM25_PF_GPTIMER16B2CCQEILP1_IDX ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM25_PF_ANACOMP1_OUT      ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM25_PF_GPTIMER16BADV4CC1_FAULT1 ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM25_PF_I2S1_WCLK         ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM25_PF_SPGSS0_U2_CTS     ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM25_PF_SPGSS1_U5_SCLK_SCL_RX ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM25_PF_SPGSS1_U5_PICO_SDA_TX ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM26 Bits */
/* IOMUX_M33C1_PINCM26[WCOMP] Bits */
#define IOMUX_M33C1_PINCM26_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM26_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM26_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM26_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM26[WUEN] Bits */
#define IOMUX_M33C1_PINCM26_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM26_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM26_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM26_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM26[INV] Bits */
#define IOMUX_M33C1_PINCM26_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM26_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM26_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM26_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM26[Z1] Bits */
#define IOMUX_M33C1_PINCM26_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM26_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM26_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM26_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM26[DRV] Bits */
#define IOMUX_M33C1_PINCM26_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM26_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM26_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM26_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM26[INENA] Bits */
#define IOMUX_M33C1_PINCM26_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM26_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM26_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM26_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM26[PIPU] Bits */
#define IOMUX_M33C1_PINCM26_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM26_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM26_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM26_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM26[PIPD] Bits */
#define IOMUX_M33C1_PINCM26_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM26_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM26_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM26_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM26[PC] Bits */
#define IOMUX_M33C1_PINCM26_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM26_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM26_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM26_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM26[PF] Bits */
#define IOMUX_M33C1_PINCM26_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM26_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM26_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM26_PF_GPIO1_DIO09       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM26_PF_GPTIMER16B2CCQEILP1_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM26_PF_GPTIMER16BADV4CC0_CCP0_CMPL ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM26_PF_I2S1_BCLK         ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM26_PF_SPGSS0_U2_RTS     ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM26_PF_SPGSS1_U5_PICO_SDA_TX ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM26_PF_SPGSS1_U5_SCLK_SCL_RX ((uint32_t)0x00000007U)

/* IOMUX_M33C1_PINCM27 Bits */
/* IOMUX_M33C1_PINCM27[WCOMP] Bits */
#define IOMUX_M33C1_PINCM27_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM27_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM27_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM27_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM27[WUEN] Bits */
#define IOMUX_M33C1_PINCM27_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM27_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM27_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM27_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM27[INV] Bits */
#define IOMUX_M33C1_PINCM27_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM27_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM27_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM27_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM27[Z1] Bits */
#define IOMUX_M33C1_PINCM27_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM27_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM27_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM27_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM27[INENA] Bits */
#define IOMUX_M33C1_PINCM27_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM27_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM27_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM27_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM27[PIPU] Bits */
#define IOMUX_M33C1_PINCM27_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM27_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM27_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM27_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM27[PIPD] Bits */
#define IOMUX_M33C1_PINCM27_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM27_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM27_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM27_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM27[PC] Bits */
#define IOMUX_M33C1_PINCM27_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM27_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM27_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM27_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM27[PF] Bits */
#define IOMUX_M33C1_PINCM27_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM27_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM27_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM27_PF_GPIO1_DIO10       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM27_PF_GPTIMER16B2CCLP2_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM27_PF_GPTIMER16B2CCLP0_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM27_PF_I2S1_MCLK         ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM27_PF_SPGSS2_U1_PICO_SDA_TX ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM27_PF_GPTIMER16BADV4CC1_CCP1 ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM27_PF_I2S0_WCLK         ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM28 Bits */
/* IOMUX_M33C1_PINCM28[WCOMP] Bits */
#define IOMUX_M33C1_PINCM28_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM28_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM28_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM28_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM28[WUEN] Bits */
#define IOMUX_M33C1_PINCM28_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM28_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM28_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM28_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM28[INV] Bits */
#define IOMUX_M33C1_PINCM28_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM28_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM28_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM28_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM28[Z1] Bits */
#define IOMUX_M33C1_PINCM28_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM28_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM28_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM28_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM28[INENA] Bits */
#define IOMUX_M33C1_PINCM28_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM28_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM28_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM28_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM28[PIPU] Bits */
#define IOMUX_M33C1_PINCM28_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM28_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM28_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM28_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM28[PIPD] Bits */
#define IOMUX_M33C1_PINCM28_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM28_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM28_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM28_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM28[PC] Bits */
#define IOMUX_M33C1_PINCM28_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM28_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM28_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM28_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM28[PF] Bits */
#define IOMUX_M33C1_PINCM28_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM28_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM28_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM28_PF_GPIO1_DIO11       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM28_PF_GPTIMER16B2CCLP2_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM28_PF_SYSCTL_CLK_OUT    ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM28_PF_GPTIMER16B2CCLP0_CCP1 ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM28_PF_SPGSS2_U1_SCLK_SCL_RX ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM28_PF_GPTIMER16BADV4CC1_CCP1_CMPL ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM28_PF_I2S0_BCLK         ((uint32_t)0x00000008U)

