TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM29 Bits */
/* IOMUX_M33C1_PINCM29[WCOMP] Bits */
#define IOMUX_M33C1_PINCM29_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM29_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM29_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM29_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM29[WUEN] Bits */
#define IOMUX_M33C1_PINCM29_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM29_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM29_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM29_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM29[INV] Bits */
#define IOMUX_M33C1_PINCM29_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM29_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM29_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM29_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM29[Z1] Bits */
#define IOMUX_M33C1_PINCM29_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM29_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM29_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM29_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM29[INENA] Bits */
#define IOMUX_M33C1_PINCM29_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM29_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM29_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM29_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM29[PIPU] Bits */
#define IOMUX_M33C1_PINCM29_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM29_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM29_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM29_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM29[PIPD] Bits */
#define IOMUX_M33C1_PINCM29_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM29_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM29_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM29_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM29[PC] Bits */
#define IOMUX_M33C1_PINCM29_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM29_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM29_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM29_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM29[PF] Bits */
#define IOMUX_M33C1_PINCM29_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM29_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM29_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM29_PF_GPIO1_DIO12       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM29_PF_GPTIMER16BADV4CC0_FAULT1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM29_PF_SPGSS1_U5_PICO_SDA_TX ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM29_PF_SPGSS2_U1_CS0_CTS ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM29_PF_I2S0_AD0          ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM30 Bits */
/* IOMUX_M33C1_PINCM30[WCOMP] Bits */
#define IOMUX_M33C1_PINCM30_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM30_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM30_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM30_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM30[WUEN] Bits */
#define IOMUX_M33C1_PINCM30_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM30_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM30_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM30_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM30[INV] Bits */
#define IOMUX_M33C1_PINCM30_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM30_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM30_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM30_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM30[Z1] Bits */
#define IOMUX_M33C1_PINCM30_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM30_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM30_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM30_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM30[INENA] Bits */
#define IOMUX_M33C1_PINCM30_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM30_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM30_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM30_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM30[PIPU] Bits */
#define IOMUX_M33C1_PINCM30_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM30_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM30_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM30_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM30[PIPD] Bits */
#define IOMUX_M33C1_PINCM30_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM30_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM30_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM30_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM30[PC] Bits */
#define IOMUX_M33C1_PINCM30_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM30_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM30_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM30_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM30[PF] Bits */
#define IOMUX_M33C1_PINCM30_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM30_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM30_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM30_PF_GPIO1_DIO13       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM30_PF_GPTIMER32B2CC0_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM30_PF_GPTIMER16BADV4CC0_CCP1_CMPL ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM30_PF_SPGSS1_U5_SCLK_SCL_RX ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM30_PF_SPGSS2_U1_POCI_RTS ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM30_PF_QSPI_CS2_MISO2    ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM30_PF_I2S0_AD1          ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM31 Bits */
/* IOMUX_M33C1_PINCM31[WCOMP] Bits */
#define IOMUX_M33C1_PINCM31_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM31_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM31_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM31_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM31[WUEN] Bits */
#define IOMUX_M33C1_PINCM31_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM31_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM31_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM31_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM31[INV] Bits */
#define IOMUX_M33C1_PINCM31_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM31_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM31_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM31_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM31[Z1] Bits */
#define IOMUX_M33C1_PINCM31_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM31_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM31_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM31_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM31[INENA] Bits */
#define IOMUX_M33C1_PINCM31_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM31_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM31_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM31_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM31[PIPU] Bits */
#define IOMUX_M33C1_PINCM31_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM31_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM31_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM31_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM31[PIPD] Bits */
#define IOMUX_M33C1_PINCM31_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM31_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM31_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM31_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM31[PC] Bits */
#define IOMUX_M33C1_PINCM31_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM31_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM31_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM31_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM31[PF] Bits */
#define IOMUX_M33C1_PINCM31_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM31_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM31_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM31_PF_GPIO1_DIO14       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM31_PF_GPTIMER16B2CCQEILP0_IDX ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM31_PF_GPTIMER32B2CC0_CCP1 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM31_PF_GPTIMER16BADV4CC0_CCP0 ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM31_PF_QSPI_CS0          ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM31_PF_SPGSS1_U5_POCI_RTS ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM31_PF_I2S0_MCLK         ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM32 Bits */
/* IOMUX_M33C1_PINCM32[WCOMP] Bits */
#define IOMUX_M33C1_PINCM32_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM32_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM32_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM32_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM32[WUEN] Bits */
#define IOMUX_M33C1_PINCM32_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM32_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM32_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM32_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM32[INV] Bits */
#define IOMUX_M33C1_PINCM32_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM32_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM32_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM32_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM32[Z1] Bits */
#define IOMUX_M33C1_PINCM32_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM32_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM32_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM32_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM32[DRV] Bits */
#define IOMUX_M33C1_PINCM32_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM32_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM32_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM32_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM32[INENA] Bits */
#define IOMUX_M33C1_PINCM32_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM32_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM32_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM32_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM32[PIPU] Bits */
#define IOMUX_M33C1_PINCM32_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM32_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM32_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM32_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM32[PIPD] Bits */
#define IOMUX_M33C1_PINCM32_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM32_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM32_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM32_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM32[PC] Bits */
#define IOMUX_M33C1_PINCM32_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM32_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM32_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM32_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM32[PF] Bits */
#define IOMUX_M33C1_PINCM32_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM32_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM32_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM32_PF_GPIO1_DIO15       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM32_PF_GPTIMER16B2CCLP3_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM32_PF_GPTIMER16B2CCQEILP0_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM32_PF_GPTIMER16BADV4CC1_CCP3 ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM32_PF_I2S0_MCLK         ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM32_PF_QSPI_IO3          ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM32_PF_SPGSS2_U0_PICO_SDA_TX ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM32_PF_SPGSS1_U4_TX      ((uint32_t)0x00000008U)

