TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM33 Bits */
/* IOMUX_M33C1_PINCM33[WCOMP] Bits */
#define IOMUX_M33C1_PINCM33_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM33_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM33_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM33_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM33[WUEN] Bits */
#define IOMUX_M33C1_PINCM33_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM33_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM33_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM33_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM33[INV] Bits */
#define IOMUX_M33C1_PINCM33_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM33_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM33_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM33_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM33[Z1] Bits */
#define IOMUX_M33C1_PINCM33_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM33_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM33_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM33_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM33[DRV] Bits */
#define IOMUX_M33C1_PINCM33_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM33_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM33_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM33_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM33[INENA] Bits */
#define IOMUX_M33C1_PINCM33_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM33_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM33_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM33_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM33[PIPU] Bits */
#define IOMUX_M33C1_PINCM33_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM33_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM33_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM33_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM33[PIPD] Bits */
#define IOMUX_M33C1_PINCM33_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM33_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM33_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM33_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM33[PC] Bits */
#define IOMUX_M33C1_PINCM33_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM33_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM33_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM33_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM33[PF] Bits */
#define IOMUX_M33C1_PINCM33_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM33_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM33_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM33_PF_GPIO1_DIO16       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM33_PF_GPTIMER16B2CCLP3_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM33_PF_GPTIMER16B2CCQEILP0_CCP1 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM33_PF_GPTIMER16BADV4CC1_CCP3_CMPL ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM33_PF_I2S0_WCLK         ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM33_PF_QSPI_SCLK         ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM33_PF_SPGSS2_U0_SCLK_SCL_RX ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM33_PF_SPGSS1_U4_RX      ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM34 Bits */
/* IOMUX_M33C1_PINCM34[WCOMP] Bits */
#define IOMUX_M33C1_PINCM34_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM34_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM34_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM34_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM34[WUEN] Bits */
#define IOMUX_M33C1_PINCM34_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM34_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM34_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM34_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM34[INV] Bits */
#define IOMUX_M33C1_PINCM34_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM34_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM34_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM34_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM34[Z1] Bits */
#define IOMUX_M33C1_PINCM34_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM34_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM34_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM34_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM34[DRV] Bits */
#define IOMUX_M33C1_PINCM34_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM34_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM34_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM34_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM34[INENA] Bits */
#define IOMUX_M33C1_PINCM34_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM34_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM34_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM34_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM34[PIPU] Bits */
#define IOMUX_M33C1_PINCM34_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM34_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM34_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM34_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM34[PIPD] Bits */
#define IOMUX_M33C1_PINCM34_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM34_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM34_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM34_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM34[PC] Bits */
#define IOMUX_M33C1_PINCM34_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM34_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM34_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM34_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM34[PF] Bits */
#define IOMUX_M33C1_PINCM34_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM34_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM34_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM34_PF_GPIO0_DIO12       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM34_PF_MCAN0_CANTX       ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM34_PF_GPTIMER16B2CCLP0_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM34_PF_SYSCTL_FCC_IN     ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM34_PF_I2S0_BCLK         ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM34_PF_QSPI_MOSI         ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM34_PF_SPGSS1_U5_CS0_CTS ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM34_PF_GPTIMER16BADV4CC1_CCP1 ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM35 Bits */
/* IOMUX_M33C1_PINCM35[WCOMP] Bits */
#define IOMUX_M33C1_PINCM35_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM35_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM35_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM35_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM35[WUEN] Bits */
#define IOMUX_M33C1_PINCM35_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM35_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM35_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM35_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM35[INV] Bits */
#define IOMUX_M33C1_PINCM35_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM35_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM35_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM35_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM35[Z1] Bits */
#define IOMUX_M33C1_PINCM35_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM35_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM35_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM35_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM35[DRV] Bits */
#define IOMUX_M33C1_PINCM35_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM35_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM35_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM35_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM35[INENA] Bits */
#define IOMUX_M33C1_PINCM35_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM35_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM35_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM35_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM35[PIPU] Bits */
#define IOMUX_M33C1_PINCM35_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM35_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM35_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM35_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM35[PIPD] Bits */
#define IOMUX_M33C1_PINCM35_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM35_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM35_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM35_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM35[PC] Bits */
#define IOMUX_M33C1_PINCM35_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM35_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM35_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM35_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM35[PF] Bits */
#define IOMUX_M33C1_PINCM35_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM35_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM35_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM35_PF_GPIO0_DIO13       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM35_PF_MCAN0_CANRX       ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM35_PF_GPTIMER16B2CCLP0_CCP1 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM35_PF_GPTIMER16BADV4CC1_FAULT1 ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM35_PF_I2S0_AD0          ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM35_PF_QSPI_IO2          ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM35_PF_SPGSS1_U5_SCLK_SCL_RX ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM35_PF_SPGSS1_U5_POCI_RTS ((uint32_t)0x00000008U)
#define IOMUX_M33C1_PINCM35_PF_SPGSS1_U4_TX      ((uint32_t)0x00000009U)

/* IOMUX_M33C1_PINCM36 Bits */
/* IOMUX_M33C1_PINCM36[WCOMP] Bits */
#define IOMUX_M33C1_PINCM36_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM36_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM36_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM36_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM36[WUEN] Bits */
#define IOMUX_M33C1_PINCM36_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM36_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM36_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM36_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM36[INV] Bits */
#define IOMUX_M33C1_PINCM36_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM36_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM36_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM36_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM36[Z1] Bits */
#define IOMUX_M33C1_PINCM36_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM36_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM36_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM36_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM36[DRV] Bits */
#define IOMUX_M33C1_PINCM36_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM36_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM36_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM36_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM36[INENA] Bits */
#define IOMUX_M33C1_PINCM36_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM36_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM36_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM36_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM36[PIPU] Bits */
#define IOMUX_M33C1_PINCM36_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM36_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM36_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM36_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM36[PIPD] Bits */
#define IOMUX_M33C1_PINCM36_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM36_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM36_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM36_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM36[PC] Bits */
#define IOMUX_M33C1_PINCM36_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM36_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM36_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM36_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM36[PF] Bits */
#define IOMUX_M33C1_PINCM36_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM36_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM36_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM36_PF_GPIO0_DIO14       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM36_PF_SYSCTL_CLK_OUT    ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM36_PF_GPTIMER16BADV4CC1_CCP1_CMPL ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM36_PF_GPTIMER16BADV4CC0_CCP3 ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM36_PF_I2S0_AD1          ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM36_PF_QSPI_MISO         ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM36_PF_SPGSS0_U1_CTS     ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM36_PF_SPGSS1_U5_PICO_SDA_TX ((uint32_t)0x00000008U)
#define IOMUX_M33C1_PINCM36_PF_SPGSS1_U4_RX      ((uint32_t)0x00000009U)

