TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM37 Bits */
/* IOMUX_M33C1_PINCM37[WCOMP] Bits */
#define IOMUX_M33C1_PINCM37_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM37_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM37_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM37_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM37[WUEN] Bits */
#define IOMUX_M33C1_PINCM37_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM37_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM37_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM37_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM37[INV] Bits */
#define IOMUX_M33C1_PINCM37_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM37_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM37_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM37_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM37[Z1] Bits */
#define IOMUX_M33C1_PINCM37_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM37_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM37_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM37_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM37[INENA] Bits */
#define IOMUX_M33C1_PINCM37_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM37_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM37_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM37_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM37[PIPU] Bits */
#define IOMUX_M33C1_PINCM37_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM37_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM37_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM37_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM37[PIPD] Bits */
#define IOMUX_M33C1_PINCM37_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM37_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM37_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM37_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM37[PC] Bits */
#define IOMUX_M33C1_PINCM37_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM37_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM37_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM37_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM37[PF] Bits */
#define IOMUX_M33C1_PINCM37_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM37_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM37_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM37_PF_GPIO0_DIO15       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM37_PF_GPTIMER16B2CCQEILP0_IDX ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM37_PF_GPTIMER16BADV4CC0_CCP2 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM37_PF_SPGSS0_U2_SCL_RX  ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM37_PF_SPGSS1_U3_SCL     ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM37_PF_SPGSS0_U1_RTS     ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM37_PF_I2S0_WCLK         ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM38 Bits */
/* IOMUX_M33C1_PINCM38[WCOMP] Bits */
#define IOMUX_M33C1_PINCM38_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM38_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM38_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM38_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM38[WUEN] Bits */
#define IOMUX_M33C1_PINCM38_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM38_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM38_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM38_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM38[INV] Bits */
#define IOMUX_M33C1_PINCM38_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM38_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM38_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM38_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM38[Z1] Bits */
#define IOMUX_M33C1_PINCM38_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM38_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM38_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM38_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM38[INENA] Bits */
#define IOMUX_M33C1_PINCM38_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM38_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM38_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM38_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM38[PIPU] Bits */
#define IOMUX_M33C1_PINCM38_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM38_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM38_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM38_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM38[PIPD] Bits */
#define IOMUX_M33C1_PINCM38_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM38_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM38_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM38_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM38[PC] Bits */
#define IOMUX_M33C1_PINCM38_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM38_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM38_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM38_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM38[PF] Bits */
#define IOMUX_M33C1_PINCM38_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM38_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM38_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM38_PF_GPIO0_DIO16       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM38_PF_GPTIMER16BADV4CC0_CCP2_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM38_PF_SYSCTL_FCC_IN     ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM38_PF_SPGSS0_U2_SDA_TX  ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM38_PF_SPGSS1_U5_POCI_RTS ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM38_PF_SPGSS1_U3_SDA     ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM38_PF_QSPI_CS3_CD_MISO3 ((uint32_t)0x00000007U)

/* IOMUX_M33C1_PINCM39 Bits */
/* IOMUX_M33C1_PINCM39[WCOMP] Bits */
#define IOMUX_M33C1_PINCM39_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM39_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM39_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM39_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM39[WUEN] Bits */
#define IOMUX_M33C1_PINCM39_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM39_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM39_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM39_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM39[INV] Bits */
#define IOMUX_M33C1_PINCM39_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM39_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM39_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM39_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM39[Z1] Bits */
#define IOMUX_M33C1_PINCM39_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM39_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM39_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM39_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM39[INENA] Bits */
#define IOMUX_M33C1_PINCM39_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM39_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM39_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM39_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM39[PIPU] Bits */
#define IOMUX_M33C1_PINCM39_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM39_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM39_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM39_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM39[PIPD] Bits */
#define IOMUX_M33C1_PINCM39_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM39_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM39_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM39_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM39[WAKESTATE] Bits */
#define IOMUX_M33C1_PINCM39_WAKESTATE_OFS        (13)                            /* !< WAKESTATE Offset */
#define IOMUX_M33C1_PINCM39_WAKESTATE_MASK       ((uint32_t)0x00002000U)         /* !< bit */
/* IOMUX_M33C1_PINCM39[PC] Bits */
#define IOMUX_M33C1_PINCM39_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM39_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM39_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM39_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM39[PF] Bits */
#define IOMUX_M33C1_PINCM39_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM39_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM39_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM39_PF_GPIO0_DIO17       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM39_PF_GPTIMER16B2CCLP3_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM39_PF_GPTIMER16BADV4CC0_CCP3 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM39_PF_SPGSS0_U2_SDA_TX  ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM39_PF_SPGSS1_U5_SCLK_SCL_RX ((uint32_t)0x00000005U)

