TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM40 Bits */
/* IOMUX_M33C1_PINCM40[WCOMP] Bits */
#define IOMUX_M33C1_PINCM40_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM40_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM40_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM40_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM40[WUEN] Bits */
#define IOMUX_M33C1_PINCM40_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM40_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM40_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM40_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM40[INV] Bits */
#define IOMUX_M33C1_PINCM40_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM40_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM40_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM40_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM40[Z1] Bits */
#define IOMUX_M33C1_PINCM40_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM40_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM40_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM40_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM40[INENA] Bits */
#define IOMUX_M33C1_PINCM40_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM40_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM40_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM40_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM40[PIPU] Bits */
#define IOMUX_M33C1_PINCM40_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM40_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM40_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM40_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM40[PIPD] Bits */
#define IOMUX_M33C1_PINCM40_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM40_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM40_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM40_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM40[WAKESTATE] Bits */
#define IOMUX_M33C1_PINCM40_WAKESTATE_OFS        (13)                            /* !< WAKESTATE Offset */
#define IOMUX_M33C1_PINCM40_WAKESTATE_MASK       ((uint32_t)0x00002000U)         /* !< bit */
/* IOMUX_M33C1_PINCM40[PC] Bits */
#define IOMUX_M33C1_PINCM40_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM40_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM40_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM40_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM40[PF] Bits */
#define IOMUX_M33C1_PINCM40_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM40_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM40_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM40_PF_GPIO0_DIO18       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM40_PF_GPTIMER16BADV4CC0_CCP3_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM40_PF_I2S0_WCLK         ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM40_PF_SPGSS0_U2_SCL_RX  ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM40_PF_SPGSS1_U5_PICO_SDA_TX ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM40_PF_SPGSS2_U0_CS0_CTS ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM40_PF_QSPI_CS1_MISO1    ((uint32_t)0x00000007U)

/* IOMUX_M33C1_PINCM41 Bits */
/* IOMUX_M33C1_PINCM41[WCOMP] Bits */
#define IOMUX_M33C1_PINCM41_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM41_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM41_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM41_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM41[WUEN] Bits */
#define IOMUX_M33C1_PINCM41_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM41_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM41_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM41_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM41[INV] Bits */
#define IOMUX_M33C1_PINCM41_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM41_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM41_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM41_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM41[Z1] Bits */
#define IOMUX_M33C1_PINCM41_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM41_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM41_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM41_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM41[INENA] Bits */
#define IOMUX_M33C1_PINCM41_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM41_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM41_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM41_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM41[PIPU] Bits */
#define IOMUX_M33C1_PINCM41_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM41_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM41_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM41_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM41[PIPD] Bits */
#define IOMUX_M33C1_PINCM41_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM41_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM41_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM41_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM41[PC] Bits */
#define IOMUX_M33C1_PINCM41_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM41_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM41_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM41_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM41[PF] Bits */
#define IOMUX_M33C1_PINCM41_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM41_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM41_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM41_PF_GPIO0_DIO19       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM41_PF_DEBUGSS_SWDIO     ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM41_PF_SPGSS1_U2_SDA     ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM41_PF_SPGSS1_U4_TX      ((uint32_t)0x00000004U)

/* IOMUX_M33C1_PINCM42 Bits */
/* IOMUX_M33C1_PINCM42[WCOMP] Bits */
#define IOMUX_M33C1_PINCM42_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM42_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM42_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM42_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM42[WUEN] Bits */
#define IOMUX_M33C1_PINCM42_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM42_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM42_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM42_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM42[INV] Bits */
#define IOMUX_M33C1_PINCM42_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM42_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM42_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM42_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM42[Z1] Bits */
#define IOMUX_M33C1_PINCM42_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM42_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM42_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM42_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM42[INENA] Bits */
#define IOMUX_M33C1_PINCM42_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM42_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM42_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM42_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM42[PIPU] Bits */
#define IOMUX_M33C1_PINCM42_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM42_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM42_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM42_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM42[PIPD] Bits */
#define IOMUX_M33C1_PINCM42_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM42_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM42_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM42_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM42[PC] Bits */
#define IOMUX_M33C1_PINCM42_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM42_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM42_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM42_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM42[PF] Bits */
#define IOMUX_M33C1_PINCM42_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM42_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM42_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM42_PF_GPIO0_DIO20       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM42_PF_DEBUGSS_SWCLK     ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM42_PF_SPGSS1_U2_SCL     ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM42_PF_SPGSS1_U4_RX      ((uint32_t)0x00000004U)

/* IOMUX_M33C1_PINCM43 Bits */
/* IOMUX_M33C1_PINCM43[WCOMP] Bits */
#define IOMUX_M33C1_PINCM43_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM43_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM43_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM43_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM43[WUEN] Bits */
#define IOMUX_M33C1_PINCM43_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM43_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM43_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM43_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM43[INV] Bits */
#define IOMUX_M33C1_PINCM43_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM43_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM43_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM43_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM43[Z1] Bits */
#define IOMUX_M33C1_PINCM43_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM43_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM43_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM43_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM43[INENA] Bits */
#define IOMUX_M33C1_PINCM43_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM43_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM43_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM43_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM43[PIPU] Bits */
#define IOMUX_M33C1_PINCM43_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM43_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM43_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM43_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM43[PIPD] Bits */
#define IOMUX_M33C1_PINCM43_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM43_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM43_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM43_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM43[PC] Bits */
#define IOMUX_M33C1_PINCM43_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM43_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM43_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM43_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM43[PF] Bits */
#define IOMUX_M33C1_PINCM43_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM43_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM43_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM43_PF_GPIO1_DIO17       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM43_PF_GPTIMER16BADV4CC0_CCP2 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM43_PF_SPGSS2_U0_PICO_SDA_TX ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM43_PF_SPGSS1_U0_PICO    ((uint32_t)0x00000004U)

