TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM44 Bits */
/* IOMUX_M33C1_PINCM44[WCOMP] Bits */
#define IOMUX_M33C1_PINCM44_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM44_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM44_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM44_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM44[WUEN] Bits */
#define IOMUX_M33C1_PINCM44_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM44_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM44_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM44_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM44[INV] Bits */
#define IOMUX_M33C1_PINCM44_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM44_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM44_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM44_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM44[Z1] Bits */
#define IOMUX_M33C1_PINCM44_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM44_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM44_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM44_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM44[INENA] Bits */
#define IOMUX_M33C1_PINCM44_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM44_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM44_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM44_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM44[PIPU] Bits */
#define IOMUX_M33C1_PINCM44_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM44_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM44_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM44_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM44[PIPD] Bits */
#define IOMUX_M33C1_PINCM44_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM44_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM44_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM44_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM44[PC] Bits */
#define IOMUX_M33C1_PINCM44_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM44_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM44_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM44_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM44[PF] Bits */
#define IOMUX_M33C1_PINCM44_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM44_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM44_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM44_PF_GPIO1_DIO18       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM44_PF_GPTIMER16BADV4CC0_CCP2_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM44_PF_SPGSS2_U0_SCLK_SCL_RX ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM44_PF_SPGSS1_U0_SCLK    ((uint32_t)0x00000004U)

/* IOMUX_M33C1_PINCM45 Bits */
/* IOMUX_M33C1_PINCM45[WCOMP] Bits */
#define IOMUX_M33C1_PINCM45_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM45_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM45_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM45_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM45[WUEN] Bits */
#define IOMUX_M33C1_PINCM45_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM45_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM45_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM45_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM45[INV] Bits */
#define IOMUX_M33C1_PINCM45_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM45_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM45_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM45_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM45[Z1] Bits */
#define IOMUX_M33C1_PINCM45_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM45_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM45_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM45_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM45[INENA] Bits */
#define IOMUX_M33C1_PINCM45_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM45_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM45_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM45_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM45[PIPU] Bits */
#define IOMUX_M33C1_PINCM45_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM45_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM45_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM45_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM45[PIPD] Bits */
#define IOMUX_M33C1_PINCM45_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM45_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM45_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM45_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM45[PC] Bits */
#define IOMUX_M33C1_PINCM45_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM45_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM45_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM45_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM45[PF] Bits */
#define IOMUX_M33C1_PINCM45_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM45_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM45_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM45_PF_GPIO1_DIO19       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM45_PF_GPTIMER16B2CCLP3_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM45_PF_GPTIMER16BADV4CC1_CCP2 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM45_PF_SPGSS1_U0_POCI    ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM45_PF_SPGSS0_U1_CTS     ((uint32_t)0x00000005U)

/* IOMUX_M33C1_PINCM46 Bits */
/* IOMUX_M33C1_PINCM46[WCOMP] Bits */
#define IOMUX_M33C1_PINCM46_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM46_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM46_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM46_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM46[WUEN] Bits */
#define IOMUX_M33C1_PINCM46_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM46_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM46_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM46_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM46[INV] Bits */
#define IOMUX_M33C1_PINCM46_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM46_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM46_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM46_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM46[Z1] Bits */
#define IOMUX_M33C1_PINCM46_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM46_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM46_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM46_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM46[INENA] Bits */
#define IOMUX_M33C1_PINCM46_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM46_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM46_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM46_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM46[PIPU] Bits */
#define IOMUX_M33C1_PINCM46_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM46_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM46_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM46_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM46[PIPD] Bits */
#define IOMUX_M33C1_PINCM46_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM46_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM46_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM46_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM46[PC] Bits */
#define IOMUX_M33C1_PINCM46_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM46_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM46_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM46_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM46[PF] Bits */
#define IOMUX_M33C1_PINCM46_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM46_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM46_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM46_PF_GPIO0_DIO21       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM46_PF_GPTIMER16B2CCLP2_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM46_PF_GPTIMER16BADV4CC0_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM46_PF_I2S0_AD0          ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM46_PF_SPGSS0_U2_CTS     ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM46_PF_SPGSS2_U0_PICO_SDA_TX ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM46_PF_SPGSS2_U1_CS0_CTS ((uint32_t)0x00000007U)

/* IOMUX_M33C1_PINCM47 Bits */
/* IOMUX_M33C1_PINCM47[WCOMP] Bits */
#define IOMUX_M33C1_PINCM47_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM47_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM47_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM47_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM47[WUEN] Bits */
#define IOMUX_M33C1_PINCM47_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM47_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM47_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM47_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM47[INV] Bits */
#define IOMUX_M33C1_PINCM47_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM47_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM47_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM47_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM47[Z1] Bits */
#define IOMUX_M33C1_PINCM47_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM47_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM47_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM47_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM47[DRV] Bits */
#define IOMUX_M33C1_PINCM47_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM47_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM47_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM47_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM47[INENA] Bits */
#define IOMUX_M33C1_PINCM47_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM47_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM47_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM47_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM47[PIPU] Bits */
#define IOMUX_M33C1_PINCM47_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM47_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM47_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM47_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM47[PIPD] Bits */
#define IOMUX_M33C1_PINCM47_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM47_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM47_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM47_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM47[PC] Bits */
#define IOMUX_M33C1_PINCM47_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM47_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM47_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM47_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM47[PF] Bits */
#define IOMUX_M33C1_PINCM47_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM47_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM47_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM47_PF_GPIO0_DIO22       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM47_PF_GPTIMER16B2CCLP2_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM47_PF_GPTIMER16BADV4CC0_CCP0_CMPL ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM47_PF_I2S0_BCLK         ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM47_PF_SYSCTL_CLK_OUT    ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM47_PF_SPGSS2_U0_SCLK_SCL_RX ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM47_PF_SPGSS2_U1_POCI_RTS ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM47_PF_SPGSS0_U2_RTS     ((uint32_t)0x00000008U)
#define IOMUX_M33C1_PINCM47_PF_DFTSS_TDI         ((uint32_t)0x00000009U)

