TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM48 Bits */
/* IOMUX_M33C1_PINCM48[WCOMP] Bits */
#define IOMUX_M33C1_PINCM48_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM48_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM48_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM48_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM48[WUEN] Bits */
#define IOMUX_M33C1_PINCM48_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM48_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM48_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM48_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM48[INV] Bits */
#define IOMUX_M33C1_PINCM48_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM48_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM48_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM48_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM48[Z1] Bits */
#define IOMUX_M33C1_PINCM48_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM48_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM48_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM48_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM48[INENA] Bits */
#define IOMUX_M33C1_PINCM48_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM48_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM48_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM48_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM48[PIPU] Bits */
#define IOMUX_M33C1_PINCM48_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM48_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM48_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM48_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM48[PIPD] Bits */
#define IOMUX_M33C1_PINCM48_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM48_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM48_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM48_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM48[PC] Bits */
#define IOMUX_M33C1_PINCM48_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM48_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM48_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM48_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM48[PF] Bits */
#define IOMUX_M33C1_PINCM48_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM48_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM48_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM48_PF_GPIO1_DIO20       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM48_PF_GPTIMER32B2CC0_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM48_PF_GPTIMER16BADV4CC0_CCP1 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM48_PF_GPTIMER16BADV4CC1_CCP2_CMPL ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM48_PF_I2S1_AD0          ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM48_PF_SPGSS1_U0_CS2     ((uint32_t)0x00000006U)

/* IOMUX_M33C1_PINCM49 Bits */
/* IOMUX_M33C1_PINCM49[WCOMP] Bits */
#define IOMUX_M33C1_PINCM49_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM49_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM49_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM49_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM49[WUEN] Bits */
#define IOMUX_M33C1_PINCM49_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM49_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM49_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM49_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM49[INV] Bits */
#define IOMUX_M33C1_PINCM49_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM49_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM49_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM49_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM49[Z1] Bits */
#define IOMUX_M33C1_PINCM49_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM49_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM49_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM49_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM49[INENA] Bits */
#define IOMUX_M33C1_PINCM49_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM49_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM49_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM49_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM49[PIPU] Bits */
#define IOMUX_M33C1_PINCM49_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM49_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM49_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM49_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM49[PIPD] Bits */
#define IOMUX_M33C1_PINCM49_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM49_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM49_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM49_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM49[PC] Bits */
#define IOMUX_M33C1_PINCM49_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM49_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM49_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM49_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM49[PF] Bits */
#define IOMUX_M33C1_PINCM49_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM49_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM49_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM49_PF_GPIO1_DIO21       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM49_PF_GPTIMER16B2CCQEILP0_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM49_PF_MCAN1_CANTX       ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM49_PF_GPTIMER16BADV4CC1_CCP3 ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM49_PF_I2S1_AD1          ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM49_PF_SPGSS2_U3_SCL_RX  ((uint32_t)0x00000006U)

/* IOMUX_M33C1_PINCM50 Bits */
/* IOMUX_M33C1_PINCM50[WCOMP] Bits */
#define IOMUX_M33C1_PINCM50_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM50_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM50_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM50_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM50[WUEN] Bits */
#define IOMUX_M33C1_PINCM50_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM50_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM50_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM50_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM50[INV] Bits */
#define IOMUX_M33C1_PINCM50_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM50_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM50_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM50_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM50[Z1] Bits */
#define IOMUX_M33C1_PINCM50_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM50_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM50_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM50_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM50[INENA] Bits */
#define IOMUX_M33C1_PINCM50_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM50_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM50_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM50_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM50[PIPU] Bits */
#define IOMUX_M33C1_PINCM50_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM50_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM50_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM50_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM50[PIPD] Bits */
#define IOMUX_M33C1_PINCM50_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM50_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM50_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM50_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM50[PC] Bits */
#define IOMUX_M33C1_PINCM50_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM50_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM50_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM50_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM50[PF] Bits */
#define IOMUX_M33C1_PINCM50_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM50_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM50_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM50_PF_GPIO1_DIO22       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM50_PF_GPTIMER16B2CCQEILP0_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM50_PF_MCAN1_CANRX       ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM50_PF_GPTIMER16BADV4CC1_CCP3_CMPL ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM50_PF_I2S1_WCLK         ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM50_PF_SPGSS2_U3_SDA_TX  ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM50_PF_SPGSS1_U5_PICO_SDA_TX ((uint32_t)0x00000007U)

/* IOMUX_M33C1_PINCM51 Bits */
/* IOMUX_M33C1_PINCM51[WCOMP] Bits */
#define IOMUX_M33C1_PINCM51_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM51_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM51_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM51_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM51[WUEN] Bits */
#define IOMUX_M33C1_PINCM51_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM51_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM51_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM51_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM51[INV] Bits */
#define IOMUX_M33C1_PINCM51_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM51_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM51_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM51_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM51[Z1] Bits */
#define IOMUX_M33C1_PINCM51_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM51_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM51_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM51_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM51[INENA] Bits */
#define IOMUX_M33C1_PINCM51_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM51_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM51_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM51_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM51[PIPU] Bits */
#define IOMUX_M33C1_PINCM51_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM51_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM51_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM51_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM51[PIPD] Bits */
#define IOMUX_M33C1_PINCM51_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM51_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM51_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM51_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM51[PC] Bits */
#define IOMUX_M33C1_PINCM51_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM51_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM51_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM51_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM51[PF] Bits */
#define IOMUX_M33C1_PINCM51_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM51_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM51_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM51_PF_GPIO1_DIO23       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM51_PF_GPTIMER16B2CCLP1_CCP0 ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM51_PF_I2S1_BCLK         ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM51_PF_SPGSS2_U3_CTS     ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM51_PF_SPGSS1_U5_SCLK_SCL_RX ((uint32_t)0x00000007U)

