TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM52 Bits */
/* IOMUX_M33C1_PINCM52[WCOMP] Bits */
#define IOMUX_M33C1_PINCM52_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM52_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM52_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM52_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM52[WUEN] Bits */
#define IOMUX_M33C1_PINCM52_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM52_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM52_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM52_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM52[INV] Bits */
#define IOMUX_M33C1_PINCM52_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM52_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM52_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM52_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM52[Z1] Bits */
#define IOMUX_M33C1_PINCM52_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM52_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM52_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM52_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM52[INENA] Bits */
#define IOMUX_M33C1_PINCM52_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM52_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM52_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM52_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM52[PIPU] Bits */
#define IOMUX_M33C1_PINCM52_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM52_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM52_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM52_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM52[PIPD] Bits */
#define IOMUX_M33C1_PINCM52_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM52_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM52_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM52_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM52[PC] Bits */
#define IOMUX_M33C1_PINCM52_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM52_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM52_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM52_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM52[PF] Bits */
#define IOMUX_M33C1_PINCM52_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM52_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM52_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM52_PF_GPIO1_DIO24       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM52_PF_GPTIMER32B2CC0_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM52_PF_GPTIMER16BADV4CC1_FAULT2 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM52_PF_GPTIMER16B2CCLP1_CCP1 ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM52_PF_I2S1_MCLK         ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM52_PF_SPGSS2_U3_RTS     ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM52_PF_SPGSS1_U0_CS3     ((uint32_t)0x00000007U)

/* IOMUX_M33C1_PINCM53 Bits */
/* IOMUX_M33C1_PINCM53[WCOMP] Bits */
#define IOMUX_M33C1_PINCM53_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM53_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM53_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM53_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM53[WUEN] Bits */
#define IOMUX_M33C1_PINCM53_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM53_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM53_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM53_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM53[INV] Bits */
#define IOMUX_M33C1_PINCM53_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM53_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM53_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM53_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM53[Z1] Bits */
#define IOMUX_M33C1_PINCM53_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM53_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM53_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM53_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM53[INENA] Bits */
#define IOMUX_M33C1_PINCM53_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM53_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM53_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM53_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM53[PIPU] Bits */
#define IOMUX_M33C1_PINCM53_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM53_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM53_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM53_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM53[PIPD] Bits */
#define IOMUX_M33C1_PINCM53_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM53_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM53_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM53_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM53[PC] Bits */
#define IOMUX_M33C1_PINCM53_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM53_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM53_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM53_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM53[PF] Bits */
#define IOMUX_M33C1_PINCM53_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM53_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM53_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM53_PF_GPIO0_DIO23       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM53_PF_GPTIMER16BADV4CC0_CCP3 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM53_PF_I2S0_WCLK         ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM53_PF_SPGSS2_U0_PICO_SDA_TX ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM53_PF_SPGSS1_U5_CS0_CTS ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM53_PF_SPGSS1_U0_CS3     ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM53_PF_SPGSS2_U1_SCLK_SCL_RX ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM53_PF_GPTIMER16B2CCLP0_CCP0 ((uint32_t)0x00000009U)

/* IOMUX_M33C1_PINCM54 Bits */
/* IOMUX_M33C1_PINCM54[WCOMP] Bits */
#define IOMUX_M33C1_PINCM54_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM54_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM54_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM54_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM54[WUEN] Bits */
#define IOMUX_M33C1_PINCM54_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM54_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM54_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM54_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM54[INV] Bits */
#define IOMUX_M33C1_PINCM54_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM54_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM54_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM54_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM54[Z1] Bits */
#define IOMUX_M33C1_PINCM54_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM54_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM54_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM54_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM54[INENA] Bits */
#define IOMUX_M33C1_PINCM54_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM54_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM54_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM54_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM54[PIPU] Bits */
#define IOMUX_M33C1_PINCM54_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM54_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM54_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM54_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM54[PIPD] Bits */
#define IOMUX_M33C1_PINCM54_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM54_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM54_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM54_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM54[PC] Bits */
#define IOMUX_M33C1_PINCM54_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM54_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM54_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM54_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM54[PF] Bits */
#define IOMUX_M33C1_PINCM54_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM54_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM54_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM54_PF_GPIO0_DIO24       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM54_PF_GPTIMER16BADV4CC0_CCP3_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM54_PF_I2S0_AD1          ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM54_PF_SPGSS2_U0_SCLK_SCL_RX ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM54_PF_SPGSS1_U5_POCI_RTS ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM54_PF_SPGSS1_U0_CS2     ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM54_PF_SPGSS2_U1_PICO_SDA_TX ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM54_PF_GPTIMER32B2CC0_CCP1 ((uint32_t)0x00000008U)
#define IOMUX_M33C1_PINCM54_PF_GPTIMER16B2CCLP0_CCP1 ((uint32_t)0x00000009U)

/* IOMUX_M33C1_PINCM55 Bits */
/* IOMUX_M33C1_PINCM55[WCOMP] Bits */
#define IOMUX_M33C1_PINCM55_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM55_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM55_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM55_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM55[WUEN] Bits */
#define IOMUX_M33C1_PINCM55_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM55_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM55_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM55_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM55[INV] Bits */
#define IOMUX_M33C1_PINCM55_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM55_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM55_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM55_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM55[Z1] Bits */
#define IOMUX_M33C1_PINCM55_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM55_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM55_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM55_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM55[DRV] Bits */
#define IOMUX_M33C1_PINCM55_DRV_OFS              (20)                            /* !< DRV Offset */
#define IOMUX_M33C1_PINCM55_DRV_MASK             ((uint32_t)0x00100000U)         /* !< bit */
#define IOMUX_M33C1_PINCM55_DRV_DRIVEVALUE0      ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM55_DRV_DRIVEVALUE1      ((uint32_t)0x00100000U)
/* IOMUX_M33C1_PINCM55[INENA] Bits */
#define IOMUX_M33C1_PINCM55_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM55_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM55_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM55_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM55[PIPU] Bits */
#define IOMUX_M33C1_PINCM55_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM55_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM55_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM55_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM55[PIPD] Bits */
#define IOMUX_M33C1_PINCM55_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM55_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM55_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM55_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM55[PC] Bits */
#define IOMUX_M33C1_PINCM55_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM55_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM55_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM55_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM55[PF] Bits */
#define IOMUX_M33C1_PINCM55_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM55_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM55_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM55_PF_GPIO0_DIO25       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM55_PF_GPTIMER16BADV4CC0_CCP1_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM55_PF_I2S0_AD0          ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM55_PF_SPGSS1_U5_SCLK_SCL_RX ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM55_PF_SPGSS2_U2_SCLK_SCL_RX ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM55_PF_SPGSS2_U0_POCI_RTS ((uint32_t)0x00000006U)

