TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM56 Bits */
/* IOMUX_M33C1_PINCM56[WCOMP] Bits */
#define IOMUX_M33C1_PINCM56_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM56_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM56_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM56_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM56[WUEN] Bits */
#define IOMUX_M33C1_PINCM56_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM56_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM56_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM56_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM56[INV] Bits */
#define IOMUX_M33C1_PINCM56_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM56_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM56_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM56_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM56[Z1] Bits */
#define IOMUX_M33C1_PINCM56_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM56_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM56_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM56_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM56[INENA] Bits */
#define IOMUX_M33C1_PINCM56_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM56_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM56_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM56_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM56[PIPU] Bits */
#define IOMUX_M33C1_PINCM56_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM56_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM56_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM56_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM56[PIPD] Bits */
#define IOMUX_M33C1_PINCM56_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM56_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM56_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM56_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM56[PC] Bits */
#define IOMUX_M33C1_PINCM56_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM56_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM56_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM56_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM56[PF] Bits */
#define IOMUX_M33C1_PINCM56_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM56_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM56_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM56_PF_GPIO1_DIO25       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM56_PF_GPTIMER16BADV4CC0_FAULT2 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM56_PF_I2S0_BCLK         ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM56_PF_SPGSS0_U1_CTS     ((uint32_t)0x00000004U)

/* IOMUX_M33C1_PINCM57 Bits */
/* IOMUX_M33C1_PINCM57[WCOMP] Bits */
#define IOMUX_M33C1_PINCM57_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM57_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM57_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM57_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM57[WUEN] Bits */
#define IOMUX_M33C1_PINCM57_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM57_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM57_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM57_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM57[INV] Bits */
#define IOMUX_M33C1_PINCM57_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM57_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM57_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM57_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM57[Z1] Bits */
#define IOMUX_M33C1_PINCM57_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM57_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM57_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM57_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM57[INENA] Bits */
#define IOMUX_M33C1_PINCM57_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM57_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM57_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM57_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM57[PIPU] Bits */
#define IOMUX_M33C1_PINCM57_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM57_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM57_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM57_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM57[PIPD] Bits */
#define IOMUX_M33C1_PINCM57_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM57_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM57_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM57_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM57[PC] Bits */
#define IOMUX_M33C1_PINCM57_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM57_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM57_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM57_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM57[PF] Bits */
#define IOMUX_M33C1_PINCM57_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM57_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM57_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM57_PF_GPIO1_DIO26       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM57_PF_GPTIMER16B2CCLP2_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM57_PF_I2S0_MCLK         ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM57_PF_SPGSS0_U1_RTS     ((uint32_t)0x00000004U)

/* IOMUX_M33C1_PINCM58 Bits */
/* IOMUX_M33C1_PINCM58[WCOMP] Bits */
#define IOMUX_M33C1_PINCM58_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM58_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM58_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM58_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM58[WUEN] Bits */
#define IOMUX_M33C1_PINCM58_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM58_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM58_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM58_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM58[INV] Bits */
#define IOMUX_M33C1_PINCM58_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM58_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM58_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM58_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM58[Z1] Bits */
#define IOMUX_M33C1_PINCM58_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM58_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM58_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM58_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM58[INENA] Bits */
#define IOMUX_M33C1_PINCM58_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM58_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM58_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM58_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM58[PIPU] Bits */
#define IOMUX_M33C1_PINCM58_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM58_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM58_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM58_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM58[PIPD] Bits */
#define IOMUX_M33C1_PINCM58_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM58_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM58_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM58_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM58[PC] Bits */
#define IOMUX_M33C1_PINCM58_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM58_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM58_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM58_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM58[PF] Bits */
#define IOMUX_M33C1_PINCM58_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM58_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM58_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM58_PF_GPIO1_DIO27       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM58_PF_GPTIMER16B2CCLP2_CCP1 ((uint32_t)0x00000002U)

/* IOMUX_M33C1_PINCM59 Bits */
/* IOMUX_M33C1_PINCM59[WCOMP] Bits */
#define IOMUX_M33C1_PINCM59_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM59_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM59_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM59_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM59[WUEN] Bits */
#define IOMUX_M33C1_PINCM59_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM59_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM59_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM59_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM59[INV] Bits */
#define IOMUX_M33C1_PINCM59_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM59_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM59_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM59_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM59[Z1] Bits */
#define IOMUX_M33C1_PINCM59_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM59_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM59_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM59_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM59[INENA] Bits */
#define IOMUX_M33C1_PINCM59_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM59_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM59_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM59_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM59[PIPU] Bits */
#define IOMUX_M33C1_PINCM59_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM59_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM59_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM59_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM59[PIPD] Bits */
#define IOMUX_M33C1_PINCM59_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM59_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM59_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM59_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM59[PC] Bits */
#define IOMUX_M33C1_PINCM59_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM59_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM59_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM59_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM59[PF] Bits */
#define IOMUX_M33C1_PINCM59_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM59_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM59_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM59_PF_GPIO0_DIO26       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM59_PF_GPTIMER16B2CCLP3_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM59_PF_GPTIMER16BADV4CC0_FAULT0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM59_PF_MCAN0_CANTX       ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM59_PF_SPGSS1_U5_PICO_SDA_TX ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM59_PF_SPGSS1_U5_CS0_CTS ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM59_PF_SPGSS2_U2_PICO_SDA_TX ((uint32_t)0x00000007U)

/* IOMUX_M33C1_PINCM60 Bits */
/* IOMUX_M33C1_PINCM60[WCOMP] Bits */
#define IOMUX_M33C1_PINCM60_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM60_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM60_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM60_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM60[WUEN] Bits */
#define IOMUX_M33C1_PINCM60_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM60_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM60_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM60_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM60[INV] Bits */
#define IOMUX_M33C1_PINCM60_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM60_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM60_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM60_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM60[Z1] Bits */
#define IOMUX_M33C1_PINCM60_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM60_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM60_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM60_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM60[INENA] Bits */
#define IOMUX_M33C1_PINCM60_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM60_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM60_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM60_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM60[PIPU] Bits */
#define IOMUX_M33C1_PINCM60_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM60_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM60_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM60_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM60[PIPD] Bits */
#define IOMUX_M33C1_PINCM60_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM60_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM60_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM60_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM60[PC] Bits */
#define IOMUX_M33C1_PINCM60_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM60_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM60_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM60_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM60[PF] Bits */
#define IOMUX_M33C1_PINCM60_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM60_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM60_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM60_PF_GPIO0_DIO27       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM60_PF_GPTIMER16B2CCLP3_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM60_PF_LFSS_RTC_OUT      ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM60_PF_MCAN0_CANRX       ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM60_PF_GPTIMER16B2CCLP1_CCP0 ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM60_PF_GPTIMER16BADV4CC0_FAULT2 ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM60_PF_SPGSS2_U2_POCI_RTS ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM60_PF_SPGSS1_U0_CS1     ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM61 Bits */
/* IOMUX_M33C1_PINCM61[WCOMP] Bits */
#define IOMUX_M33C1_PINCM61_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM61_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM61_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM61_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM61[WUEN] Bits */
#define IOMUX_M33C1_PINCM61_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM61_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM61_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM61_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM61[INV] Bits */
#define IOMUX_M33C1_PINCM61_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM61_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM61_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM61_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM61[Z1] Bits */
#define IOMUX_M33C1_PINCM61_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM61_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM61_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM61_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM61[INENA] Bits */
#define IOMUX_M33C1_PINCM61_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM61_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM61_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM61_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM61[PIPU] Bits */
#define IOMUX_M33C1_PINCM61_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM61_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM61_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM61_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM61[PIPD] Bits */
#define IOMUX_M33C1_PINCM61_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM61_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM61_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM61_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM61[PC] Bits */
#define IOMUX_M33C1_PINCM61_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM61_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM61_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM61_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM61[PF] Bits */
#define IOMUX_M33C1_PINCM61_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM61_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM61_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM61_PF_GPIO2_DIO12       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM61_PF_GPTIMER16BADV4CC1_CCP0 ((uint32_t)0x00000002U)

