TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM62 Bits */
/* IOMUX_M33C1_PINCM62[WCOMP] Bits */
#define IOMUX_M33C1_PINCM62_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM62_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM62_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM62_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM62[WUEN] Bits */
#define IOMUX_M33C1_PINCM62_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM62_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM62_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM62_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM62[INV] Bits */
#define IOMUX_M33C1_PINCM62_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM62_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM62_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM62_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM62[Z1] Bits */
#define IOMUX_M33C1_PINCM62_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM62_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM62_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM62_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM62[INENA] Bits */
#define IOMUX_M33C1_PINCM62_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM62_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM62_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM62_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM62[PIPU] Bits */
#define IOMUX_M33C1_PINCM62_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM62_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM62_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM62_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM62[PIPD] Bits */
#define IOMUX_M33C1_PINCM62_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM62_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM62_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM62_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM62[PC] Bits */
#define IOMUX_M33C1_PINCM62_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM62_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM62_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM62_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM62[PF] Bits */
#define IOMUX_M33C1_PINCM62_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM62_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM62_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM62_PF_GPIO2_DIO13       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM62_PF_GPTIMER16B2CCLP1_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM62_PF_SPGSS2_U0_PICO_SDA_TX ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM62_PF_SPGSS1_U4_RTS     ((uint32_t)0x00000004U)

/* IOMUX_M33C1_PINCM63 Bits */
/* IOMUX_M33C1_PINCM63[WCOMP] Bits */
#define IOMUX_M33C1_PINCM63_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM63_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM63_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM63_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM63[WUEN] Bits */
#define IOMUX_M33C1_PINCM63_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM63_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM63_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM63_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM63[INV] Bits */
#define IOMUX_M33C1_PINCM63_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM63_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM63_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM63_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM63[Z1] Bits */
#define IOMUX_M33C1_PINCM63_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM63_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM63_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM63_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM63[INENA] Bits */
#define IOMUX_M33C1_PINCM63_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM63_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM63_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM63_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM63[PIPU] Bits */
#define IOMUX_M33C1_PINCM63_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM63_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM63_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM63_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM63[PIPD] Bits */
#define IOMUX_M33C1_PINCM63_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM63_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM63_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM63_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM63[PC] Bits */
#define IOMUX_M33C1_PINCM63_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM63_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM63_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM63_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM63[PF] Bits */
#define IOMUX_M33C1_PINCM63_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM63_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM63_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM63_PF_GPIO2_DIO14       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM63_PF_GPTIMER16B2CCLP1_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM63_PF_SPGSS2_U0_SCLK_SCL_RX ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM63_PF_SPGSS1_U4_CTS     ((uint32_t)0x00000004U)

/* IOMUX_M33C1_PINCM64 Bits */
/* IOMUX_M33C1_PINCM64[WCOMP] Bits */
#define IOMUX_M33C1_PINCM64_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM64_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM64_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM64_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM64[WUEN] Bits */
#define IOMUX_M33C1_PINCM64_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM64_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM64_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM64_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM64[INV] Bits */
#define IOMUX_M33C1_PINCM64_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM64_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM64_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM64_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM64[Z1] Bits */
#define IOMUX_M33C1_PINCM64_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM64_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM64_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM64_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM64[INENA] Bits */
#define IOMUX_M33C1_PINCM64_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM64_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM64_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM64_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM64[PIPU] Bits */
#define IOMUX_M33C1_PINCM64_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM64_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM64_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM64_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM64[PIPD] Bits */
#define IOMUX_M33C1_PINCM64_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM64_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM64_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM64_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM64[PC] Bits */
#define IOMUX_M33C1_PINCM64_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM64_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM64_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM64_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM64[PF] Bits */
#define IOMUX_M33C1_PINCM64_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM64_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM64_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM64_PF_GPIO2_DIO15       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM64_PF_GPTIMER16BADV4CC1_CCP0_CMPL ((uint32_t)0x00000002U)

/* IOMUX_M33C1_PINCM65 Bits */
/* IOMUX_M33C1_PINCM65[WCOMP] Bits */
#define IOMUX_M33C1_PINCM65_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM65_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM65_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM65_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM65[WUEN] Bits */
#define IOMUX_M33C1_PINCM65_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM65_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM65_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM65_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM65[INV] Bits */
#define IOMUX_M33C1_PINCM65_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM65_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM65_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM65_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM65[Z1] Bits */
#define IOMUX_M33C1_PINCM65_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM65_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM65_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM65_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM65[INENA] Bits */
#define IOMUX_M33C1_PINCM65_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM65_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM65_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM65_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM65[PIPU] Bits */
#define IOMUX_M33C1_PINCM65_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM65_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM65_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM65_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM65[PIPD] Bits */
#define IOMUX_M33C1_PINCM65_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM65_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM65_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM65_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM65[PC] Bits */
#define IOMUX_M33C1_PINCM65_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM65_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM65_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM65_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM65[PF] Bits */
#define IOMUX_M33C1_PINCM65_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM65_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM65_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM65_PF_GPIO1_DIO28       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM65_PF_GPTIMER16BADV4CC0_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM65_PF_SPGSS2_U2_SCLK_SCL_RX ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM65_PF_SPGSS1_U5_CS0_CTS ((uint32_t)0x00000004U)

/* IOMUX_M33C1_PINCM66 Bits */
/* IOMUX_M33C1_PINCM66[WCOMP] Bits */
#define IOMUX_M33C1_PINCM66_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM66_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM66_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM66_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM66[WUEN] Bits */
#define IOMUX_M33C1_PINCM66_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM66_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM66_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM66_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM66[INV] Bits */
#define IOMUX_M33C1_PINCM66_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM66_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM66_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM66_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM66[Z1] Bits */
#define IOMUX_M33C1_PINCM66_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM66_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM66_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM66_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM66[INENA] Bits */
#define IOMUX_M33C1_PINCM66_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM66_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM66_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM66_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM66[PIPU] Bits */
#define IOMUX_M33C1_PINCM66_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM66_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM66_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM66_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM66[PIPD] Bits */
#define IOMUX_M33C1_PINCM66_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM66_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM66_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM66_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM66[PC] Bits */
#define IOMUX_M33C1_PINCM66_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM66_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM66_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM66_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM66[PF] Bits */
#define IOMUX_M33C1_PINCM66_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM66_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM66_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM66_PF_GPIO1_DIO29       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM66_PF_GPTIMER16BADV4CC0_CCP0_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM66_PF_GPTIMER16B2CCQEILP1_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM66_PF_SPGSS2_U2_PICO_SDA_TX ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM66_PF_SPGSS1_U5_POCI_RTS ((uint32_t)0x00000005U)

