TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM67 Bits */
/* IOMUX_M33C1_PINCM67[WCOMP] Bits */
#define IOMUX_M33C1_PINCM67_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM67_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM67_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM67_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM67[WUEN] Bits */
#define IOMUX_M33C1_PINCM67_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM67_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM67_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM67_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM67[INV] Bits */
#define IOMUX_M33C1_PINCM67_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM67_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM67_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM67_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM67[Z1] Bits */
#define IOMUX_M33C1_PINCM67_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM67_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM67_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM67_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM67[INENA] Bits */
#define IOMUX_M33C1_PINCM67_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM67_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM67_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM67_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM67[PIPU] Bits */
#define IOMUX_M33C1_PINCM67_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM67_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM67_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM67_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM67[PIPD] Bits */
#define IOMUX_M33C1_PINCM67_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM67_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM67_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM67_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM67[PC] Bits */
#define IOMUX_M33C1_PINCM67_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM67_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM67_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM67_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM67[PF] Bits */
#define IOMUX_M33C1_PINCM67_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM67_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM67_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM67_PF_GPIO1_DIO30       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM67_PF_GPTIMER16BADV4CC0_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM67_PF_GPTIMER16B2CCQEILP1_CCP1 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM67_PF_SPGSS2_U2_CS0_CTS ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM67_PF_SPGSS1_U5_PICO_SDA_TX ((uint32_t)0x00000005U)

/* IOMUX_M33C1_PINCM68 Bits */
/* IOMUX_M33C1_PINCM68[WCOMP] Bits */
#define IOMUX_M33C1_PINCM68_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM68_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM68_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM68_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM68[WUEN] Bits */
#define IOMUX_M33C1_PINCM68_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM68_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM68_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM68_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM68[INV] Bits */
#define IOMUX_M33C1_PINCM68_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM68_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM68_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM68_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM68[Z1] Bits */
#define IOMUX_M33C1_PINCM68_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM68_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM68_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM68_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM68[INENA] Bits */
#define IOMUX_M33C1_PINCM68_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM68_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM68_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM68_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM68[PIPU] Bits */
#define IOMUX_M33C1_PINCM68_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM68_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM68_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM68_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM68[PIPD] Bits */
#define IOMUX_M33C1_PINCM68_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM68_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM68_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM68_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM68[PC] Bits */
#define IOMUX_M33C1_PINCM68_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM68_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM68_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM68_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM68[PF] Bits */
#define IOMUX_M33C1_PINCM68_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM68_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM68_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM68_PF_GPIO1_DIO31       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM68_PF_GPTIMER16B2CCQEILP0_IDX ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM68_PF_GPTIMER16BADV4CC0_CCP1_CMPL ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM68_PF_SPGSS2_U2_POCI_RTS ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM68_PF_SPGSS1_U5_SCLK_SCL_RX ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM68_PF_GPTIMER16B2CCQEILP1_IDX ((uint32_t)0x00000006U)

/* IOMUX_M33C1_PINCM69 Bits */
/* IOMUX_M33C1_PINCM69[WCOMP] Bits */
#define IOMUX_M33C1_PINCM69_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM69_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM69_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM69_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM69[WUEN] Bits */
#define IOMUX_M33C1_PINCM69_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM69_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM69_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM69_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM69[INV] Bits */
#define IOMUX_M33C1_PINCM69_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM69_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM69_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM69_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM69[Z1] Bits */
#define IOMUX_M33C1_PINCM69_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM69_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM69_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM69_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM69[INENA] Bits */
#define IOMUX_M33C1_PINCM69_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM69_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM69_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM69_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM69[PIPU] Bits */
#define IOMUX_M33C1_PINCM69_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM69_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM69_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM69_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM69[PIPD] Bits */
#define IOMUX_M33C1_PINCM69_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM69_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM69_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM69_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM69[PC] Bits */
#define IOMUX_M33C1_PINCM69_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM69_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM69_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM69_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM69[PF] Bits */
#define IOMUX_M33C1_PINCM69_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM69_PF_MASK              ((uint32_t)0x00000001U)         /* !< bit */
#define IOMUX_M33C1_PINCM69_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM69_PF_GPIO2_DIO16       ((uint32_t)0x00000001U)

/* IOMUX_M33C1_PINCM70 Bits */
/* IOMUX_M33C1_PINCM70[WCOMP] Bits */
#define IOMUX_M33C1_PINCM70_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM70_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM70_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM70_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM70[WUEN] Bits */
#define IOMUX_M33C1_PINCM70_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM70_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM70_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM70_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM70[INV] Bits */
#define IOMUX_M33C1_PINCM70_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM70_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM70_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM70_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM70[Z1] Bits */
#define IOMUX_M33C1_PINCM70_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM70_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM70_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM70_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM70[INENA] Bits */
#define IOMUX_M33C1_PINCM70_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM70_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM70_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM70_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM70[PIPU] Bits */
#define IOMUX_M33C1_PINCM70_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM70_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM70_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM70_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM70[PIPD] Bits */
#define IOMUX_M33C1_PINCM70_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM70_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM70_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM70_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM70[PC] Bits */
#define IOMUX_M33C1_PINCM70_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM70_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM70_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM70_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM70[PF] Bits */
#define IOMUX_M33C1_PINCM70_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM70_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM70_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM70_PF_GPIO2_DIO17       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM70_PF_GPTIMER16BADV4CC1_CCP1 ((uint32_t)0x00000002U)

