TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM71 Bits */
/* IOMUX_M33C1_PINCM71[WCOMP] Bits */
#define IOMUX_M33C1_PINCM71_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM71_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM71_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM71_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM71[WUEN] Bits */
#define IOMUX_M33C1_PINCM71_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM71_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM71_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM71_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM71[INV] Bits */
#define IOMUX_M33C1_PINCM71_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM71_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM71_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM71_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM71[Z1] Bits */
#define IOMUX_M33C1_PINCM71_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM71_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM71_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM71_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM71[INENA] Bits */
#define IOMUX_M33C1_PINCM71_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM71_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM71_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM71_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM71[PIPU] Bits */
#define IOMUX_M33C1_PINCM71_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM71_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM71_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM71_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM71[PIPD] Bits */
#define IOMUX_M33C1_PINCM71_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM71_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM71_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM71_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM71[PC] Bits */
#define IOMUX_M33C1_PINCM71_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM71_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM71_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM71_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM71[PF] Bits */
#define IOMUX_M33C1_PINCM71_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM71_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM71_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM71_PF_GPIO2_DIO18       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM71_PF_GPTIMER16BADV4CC1_CCP3 ((uint32_t)0x00000002U)

/* IOMUX_M33C1_PINCM72 Bits */
/* IOMUX_M33C1_PINCM72[WCOMP] Bits */
#define IOMUX_M33C1_PINCM72_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM72_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM72_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM72_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM72[WUEN] Bits */
#define IOMUX_M33C1_PINCM72_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM72_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM72_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM72_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM72[INV] Bits */
#define IOMUX_M33C1_PINCM72_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM72_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM72_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM72_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM72[Z1] Bits */
#define IOMUX_M33C1_PINCM72_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM72_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM72_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM72_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM72[INENA] Bits */
#define IOMUX_M33C1_PINCM72_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM72_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM72_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM72_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM72[PIPU] Bits */
#define IOMUX_M33C1_PINCM72_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM72_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM72_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM72_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM72[PIPD] Bits */
#define IOMUX_M33C1_PINCM72_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM72_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM72_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM72_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM72[PC] Bits */
#define IOMUX_M33C1_PINCM72_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM72_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM72_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM72_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM72[PF] Bits */
#define IOMUX_M33C1_PINCM72_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM72_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM72_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM72_PF_GPIO2_DIO19       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM72_PF_GPTIMER16BADV4CC1_CCP3_CMPL ((uint32_t)0x00000002U)

/* IOMUX_M33C1_PINCM73 Bits */
/* IOMUX_M33C1_PINCM73[WCOMP] Bits */
#define IOMUX_M33C1_PINCM73_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM73_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM73_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM73_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM73[WUEN] Bits */
#define IOMUX_M33C1_PINCM73_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM73_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM73_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM73_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM73[INV] Bits */
#define IOMUX_M33C1_PINCM73_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM73_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM73_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM73_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM73[Z1] Bits */
#define IOMUX_M33C1_PINCM73_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM73_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM73_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM73_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM73[INENA] Bits */
#define IOMUX_M33C1_PINCM73_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM73_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM73_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM73_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM73[PIPU] Bits */
#define IOMUX_M33C1_PINCM73_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM73_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM73_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM73_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM73[PIPD] Bits */
#define IOMUX_M33C1_PINCM73_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM73_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM73_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM73_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM73[PC] Bits */
#define IOMUX_M33C1_PINCM73_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM73_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM73_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM73_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM73[PF] Bits */
#define IOMUX_M33C1_PINCM73_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM73_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM73_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM73_PF_GPIO2_DIO20       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM73_PF_GPTIMER16BADV4CC1_FAULT2 ((uint32_t)0x00000002U)

/* IOMUX_M33C1_PINCM74 Bits */
/* IOMUX_M33C1_PINCM74[WCOMP] Bits */
#define IOMUX_M33C1_PINCM74_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM74_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM74_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM74_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM74[WUEN] Bits */
#define IOMUX_M33C1_PINCM74_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM74_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM74_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM74_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM74[INV] Bits */
#define IOMUX_M33C1_PINCM74_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM74_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM74_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM74_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM74[Z1] Bits */
#define IOMUX_M33C1_PINCM74_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM74_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM74_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM74_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM74[INENA] Bits */
#define IOMUX_M33C1_PINCM74_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM74_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM74_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM74_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM74[PIPU] Bits */
#define IOMUX_M33C1_PINCM74_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM74_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM74_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM74_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM74[PIPD] Bits */
#define IOMUX_M33C1_PINCM74_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM74_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM74_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM74_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM74[PC] Bits */
#define IOMUX_M33C1_PINCM74_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM74_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM74_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM74_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM74[PF] Bits */
#define IOMUX_M33C1_PINCM74_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM74_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM74_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM74_PF_GPIO2_DIO00       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM74_PF_GPTIMER16B2CCQEILP0_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM74_PF_GPTIMER16BADV4CC0_CCP2 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM74_PF_QSPI_CS0          ((uint32_t)0x00000007U)

