TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM75 Bits */
/* IOMUX_M33C1_PINCM75[WCOMP] Bits */
#define IOMUX_M33C1_PINCM75_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM75_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM75_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM75_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM75[WUEN] Bits */
#define IOMUX_M33C1_PINCM75_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM75_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM75_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM75_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM75[INV] Bits */
#define IOMUX_M33C1_PINCM75_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM75_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM75_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM75_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM75[Z1] Bits */
#define IOMUX_M33C1_PINCM75_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM75_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM75_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM75_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM75[INENA] Bits */
#define IOMUX_M33C1_PINCM75_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM75_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM75_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM75_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM75[PIPU] Bits */
#define IOMUX_M33C1_PINCM75_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM75_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM75_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM75_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM75[PIPD] Bits */
#define IOMUX_M33C1_PINCM75_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM75_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM75_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM75_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM75[PC] Bits */
#define IOMUX_M33C1_PINCM75_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM75_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM75_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM75_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM75[PF] Bits */
#define IOMUX_M33C1_PINCM75_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM75_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM75_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM75_PF_GPIO2_DIO01       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM75_PF_GPTIMER16B2CCQEILP0_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM75_PF_GPTIMER16BADV4CC0_CCP2_CMPL ((uint32_t)0x00000003U)

/* IOMUX_M33C1_PINCM76 Bits */
/* IOMUX_M33C1_PINCM76[WCOMP] Bits */
#define IOMUX_M33C1_PINCM76_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM76_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM76_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM76_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM76[WUEN] Bits */
#define IOMUX_M33C1_PINCM76_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM76_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM76_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM76_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM76[INV] Bits */
#define IOMUX_M33C1_PINCM76_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM76_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM76_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM76_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM76[Z1] Bits */
#define IOMUX_M33C1_PINCM76_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM76_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM76_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM76_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM76[INENA] Bits */
#define IOMUX_M33C1_PINCM76_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM76_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM76_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM76_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM76[PIPU] Bits */
#define IOMUX_M33C1_PINCM76_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM76_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM76_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM76_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM76[PIPD] Bits */
#define IOMUX_M33C1_PINCM76_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM76_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM76_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM76_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM76[PC] Bits */
#define IOMUX_M33C1_PINCM76_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM76_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM76_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM76_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM76[PF] Bits */
#define IOMUX_M33C1_PINCM76_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM76_PF_MASK              ((uint32_t)0x0000000FU)         /* !< bit */
#define IOMUX_M33C1_PINCM76_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM76_PF_GPIO2_DIO02       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM76_PF_GPTIMER16BADV4CC0_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM76_PF_GPTIMER16BADV4CC1_FAULT0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM76_PF_SPGSS1_U5_SCLK_SCL_RX ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM76_PF_GPTIMER16B2CCLP1_CCP1 ((uint32_t)0x00000005U)
#define IOMUX_M33C1_PINCM76_PF_SPGSS1_U5_CS0_CTS ((uint32_t)0x00000006U)
#define IOMUX_M33C1_PINCM76_PF_SPGSS2_U2_CS0_CTS ((uint32_t)0x00000007U)
#define IOMUX_M33C1_PINCM76_PF_SPGSS1_U0_CS0     ((uint32_t)0x00000008U)

/* IOMUX_M33C1_PINCM77 Bits */
/* IOMUX_M33C1_PINCM77[WCOMP] Bits */
#define IOMUX_M33C1_PINCM77_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM77_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM77_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM77_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM77[WUEN] Bits */
#define IOMUX_M33C1_PINCM77_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM77_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM77_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM77_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM77[INV] Bits */
#define IOMUX_M33C1_PINCM77_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM77_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM77_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM77_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM77[Z1] Bits */
#define IOMUX_M33C1_PINCM77_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM77_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM77_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM77_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM77[INENA] Bits */
#define IOMUX_M33C1_PINCM77_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM77_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM77_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM77_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM77[PIPU] Bits */
#define IOMUX_M33C1_PINCM77_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM77_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM77_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM77_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM77[PIPD] Bits */
#define IOMUX_M33C1_PINCM77_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM77_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM77_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM77_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM77[PC] Bits */
#define IOMUX_M33C1_PINCM77_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM77_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM77_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM77_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM77[PF] Bits */
#define IOMUX_M33C1_PINCM77_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM77_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM77_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM77_PF_GPIO2_DIO03       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM77_PF_GPTIMER16B2CCLP3_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM77_PF_GPTIMER16BADV4CC0_CCP0_CMPL ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM77_PF_SPGSS1_U5_PICO_SDA_TX ((uint32_t)0x00000004U)

/* IOMUX_M33C1_PINCM78 Bits */
/* IOMUX_M33C1_PINCM78[WCOMP] Bits */
#define IOMUX_M33C1_PINCM78_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM78_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM78_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM78_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM78[WUEN] Bits */
#define IOMUX_M33C1_PINCM78_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM78_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM78_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM78_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM78[INV] Bits */
#define IOMUX_M33C1_PINCM78_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM78_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM78_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM78_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM78[Z1] Bits */
#define IOMUX_M33C1_PINCM78_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM78_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM78_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM78_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM78[INENA] Bits */
#define IOMUX_M33C1_PINCM78_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM78_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM78_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM78_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM78[PIPU] Bits */
#define IOMUX_M33C1_PINCM78_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM78_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM78_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM78_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM78[PIPD] Bits */
#define IOMUX_M33C1_PINCM78_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM78_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM78_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM78_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM78[PC] Bits */
#define IOMUX_M33C1_PINCM78_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM78_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM78_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM78_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM78[PF] Bits */
#define IOMUX_M33C1_PINCM78_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM78_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM78_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM78_PF_GPIO2_DIO04       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM78_PF_GPTIMER16BADV4CC0_CCP1 ((uint32_t)0x00000002U)

