TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM79 Bits */
/* IOMUX_M33C1_PINCM79[WCOMP] Bits */
#define IOMUX_M33C1_PINCM79_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM79_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM79_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM79_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM79[WUEN] Bits */
#define IOMUX_M33C1_PINCM79_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM79_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM79_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM79_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM79[INV] Bits */
#define IOMUX_M33C1_PINCM79_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM79_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM79_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM79_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM79[Z1] Bits */
#define IOMUX_M33C1_PINCM79_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM79_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM79_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM79_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM79[INENA] Bits */
#define IOMUX_M33C1_PINCM79_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM79_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM79_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM79_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM79[PIPU] Bits */
#define IOMUX_M33C1_PINCM79_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM79_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM79_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM79_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM79[PIPD] Bits */
#define IOMUX_M33C1_PINCM79_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM79_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM79_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM79_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM79[PC] Bits */
#define IOMUX_M33C1_PINCM79_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM79_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM79_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM79_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM79[PF] Bits */
#define IOMUX_M33C1_PINCM79_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM79_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM79_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM79_PF_GPIO2_DIO05       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM79_PF_GPTIMER16BADV4CC0_CCP1_CMPL ((uint32_t)0x00000002U)

/* IOMUX_M33C1_PINCM80 Bits */
/* IOMUX_M33C1_PINCM80[WCOMP] Bits */
#define IOMUX_M33C1_PINCM80_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM80_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM80_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM80_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM80[WUEN] Bits */
#define IOMUX_M33C1_PINCM80_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM80_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM80_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM80_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM80[INV] Bits */
#define IOMUX_M33C1_PINCM80_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM80_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM80_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM80_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM80[Z1] Bits */
#define IOMUX_M33C1_PINCM80_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM80_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM80_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM80_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM80[INENA] Bits */
#define IOMUX_M33C1_PINCM80_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM80_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM80_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM80_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM80[PIPU] Bits */
#define IOMUX_M33C1_PINCM80_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM80_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM80_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM80_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM80[PIPD] Bits */
#define IOMUX_M33C1_PINCM80_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM80_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM80_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM80_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM80[PC] Bits */
#define IOMUX_M33C1_PINCM80_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM80_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM80_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM80_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM80[PF] Bits */
#define IOMUX_M33C1_PINCM80_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM80_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM80_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM80_PF_GPIO2_DIO21       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM80_PF_MCAN1_CANTX       ((uint32_t)0x00000002U)

/* IOMUX_M33C1_PINCM81 Bits */
/* IOMUX_M33C1_PINCM81[WCOMP] Bits */
#define IOMUX_M33C1_PINCM81_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM81_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM81_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM81_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM81[WUEN] Bits */
#define IOMUX_M33C1_PINCM81_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM81_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM81_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM81_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM81[INV] Bits */
#define IOMUX_M33C1_PINCM81_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM81_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM81_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM81_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM81[Z1] Bits */
#define IOMUX_M33C1_PINCM81_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM81_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM81_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM81_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM81[INENA] Bits */
#define IOMUX_M33C1_PINCM81_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM81_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM81_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM81_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM81[PIPU] Bits */
#define IOMUX_M33C1_PINCM81_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM81_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM81_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM81_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM81[PIPD] Bits */
#define IOMUX_M33C1_PINCM81_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM81_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM81_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM81_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM81[PC] Bits */
#define IOMUX_M33C1_PINCM81_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM81_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM81_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM81_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM81[PF] Bits */
#define IOMUX_M33C1_PINCM81_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM81_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM81_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM81_PF_GPIO2_DIO22       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM81_PF_MCAN1_CANRX       ((uint32_t)0x00000002U)

