TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM82 Bits */
/* IOMUX_M33C1_PINCM82[WCOMP] Bits */
#define IOMUX_M33C1_PINCM82_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM82_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM82_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM82_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM82[WUEN] Bits */
#define IOMUX_M33C1_PINCM82_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM82_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM82_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM82_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM82[INV] Bits */
#define IOMUX_M33C1_PINCM82_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM82_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM82_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM82_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM82[Z1] Bits */
#define IOMUX_M33C1_PINCM82_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM82_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM82_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM82_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM82[INENA] Bits */
#define IOMUX_M33C1_PINCM82_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM82_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM82_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM82_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM82[PIPU] Bits */
#define IOMUX_M33C1_PINCM82_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM82_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM82_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM82_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM82[PIPD] Bits */
#define IOMUX_M33C1_PINCM82_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM82_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM82_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM82_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM82[PC] Bits */
#define IOMUX_M33C1_PINCM82_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM82_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM82_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM82_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM82[PF] Bits */
#define IOMUX_M33C1_PINCM82_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM82_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM82_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM82_PF_GPIO2_DIO23       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM82_PF_GPTIMER16BADV4CC1_CCP2 ((uint32_t)0x00000002U)

/* IOMUX_M33C1_PINCM83 Bits */
/* IOMUX_M33C1_PINCM83[WCOMP] Bits */
#define IOMUX_M33C1_PINCM83_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM83_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM83_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM83_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM83[WUEN] Bits */
#define IOMUX_M33C1_PINCM83_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM83_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM83_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM83_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM83[INV] Bits */
#define IOMUX_M33C1_PINCM83_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM83_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM83_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM83_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM83[Z1] Bits */
#define IOMUX_M33C1_PINCM83_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM83_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM83_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM83_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM83[INENA] Bits */
#define IOMUX_M33C1_PINCM83_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM83_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM83_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM83_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM83[PIPU] Bits */
#define IOMUX_M33C1_PINCM83_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM83_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM83_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM83_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM83[PIPD] Bits */
#define IOMUX_M33C1_PINCM83_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM83_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM83_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM83_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM83[PC] Bits */
#define IOMUX_M33C1_PINCM83_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM83_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM83_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM83_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM83[PF] Bits */
#define IOMUX_M33C1_PINCM83_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM83_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM83_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM83_PF_GPIO2_DIO24       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM83_PF_GPTIMER16BADV4CC1_CCP2_CMPL ((uint32_t)0x00000002U)

/* IOMUX_M33C1_PINCM84 Bits */
/* IOMUX_M33C1_PINCM84[WCOMP] Bits */
#define IOMUX_M33C1_PINCM84_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM84_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM84_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM84_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM84[WUEN] Bits */
#define IOMUX_M33C1_PINCM84_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM84_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM84_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM84_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM84[INV] Bits */
#define IOMUX_M33C1_PINCM84_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM84_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM84_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM84_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM84[Z1] Bits */
#define IOMUX_M33C1_PINCM84_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM84_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM84_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM84_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM84[INENA] Bits */
#define IOMUX_M33C1_PINCM84_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM84_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM84_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM84_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM84[PIPU] Bits */
#define IOMUX_M33C1_PINCM84_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM84_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM84_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM84_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM84[PIPD] Bits */
#define IOMUX_M33C1_PINCM84_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM84_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM84_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM84_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM84[PC] Bits */
#define IOMUX_M33C1_PINCM84_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM84_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM84_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM84_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM84[PF] Bits */
#define IOMUX_M33C1_PINCM84_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM84_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM84_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM84_PF_GPIO2_DIO06       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM84_PF_GPTIMER16B2CCLP2_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM84_PF_GPTIMER16BADV4CC0_CCP0 ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM84_PF_SPGSS1_U5_PICO_SDA_TX ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM84_PF_SPGSS1_U0_CS1     ((uint32_t)0x00000005U)

/* IOMUX_M33C1_PINCM85 Bits */
/* IOMUX_M33C1_PINCM85[WCOMP] Bits */
#define IOMUX_M33C1_PINCM85_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM85_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM85_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM85_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM85[WUEN] Bits */
#define IOMUX_M33C1_PINCM85_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM85_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM85_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM85_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM85[INV] Bits */
#define IOMUX_M33C1_PINCM85_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM85_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM85_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM85_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM85[Z1] Bits */
#define IOMUX_M33C1_PINCM85_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM85_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM85_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM85_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM85[INENA] Bits */
#define IOMUX_M33C1_PINCM85_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM85_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM85_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM85_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM85[PIPU] Bits */
#define IOMUX_M33C1_PINCM85_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM85_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM85_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM85_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM85[PIPD] Bits */
#define IOMUX_M33C1_PINCM85_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM85_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM85_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM85_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM85[PC] Bits */
#define IOMUX_M33C1_PINCM85_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM85_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM85_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM85_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM85[PF] Bits */
#define IOMUX_M33C1_PINCM85_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM85_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM85_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM85_PF_GPIO2_DIO07       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM85_PF_GPTIMER16B2CCLP2_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM85_PF_GPTIMER16BADV4CC0_CCP0_CMPL ((uint32_t)0x00000003U)
#define IOMUX_M33C1_PINCM85_PF_SPGSS1_U5_SCLK_SCL_RX ((uint32_t)0x00000004U)
#define IOMUX_M33C1_PINCM85_PF_SPGSS1_U0_CS0     ((uint32_t)0x00000005U)

