TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM86 Bits */
/* IOMUX_M33C1_PINCM86[WCOMP] Bits */
#define IOMUX_M33C1_PINCM86_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM86_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM86_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM86_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM86[WUEN] Bits */
#define IOMUX_M33C1_PINCM86_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM86_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM86_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM86_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM86[INV] Bits */
#define IOMUX_M33C1_PINCM86_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM86_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM86_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM86_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM86[Z1] Bits */
#define IOMUX_M33C1_PINCM86_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM86_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM86_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM86_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM86[INENA] Bits */
#define IOMUX_M33C1_PINCM86_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM86_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM86_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM86_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM86[PIPU] Bits */
#define IOMUX_M33C1_PINCM86_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM86_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM86_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM86_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM86[PIPD] Bits */
#define IOMUX_M33C1_PINCM86_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM86_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM86_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM86_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM86[PC] Bits */
#define IOMUX_M33C1_PINCM86_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM86_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM86_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM86_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM86[PF] Bits */
#define IOMUX_M33C1_PINCM86_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM86_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM86_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM86_PF_GPIO2_DIO08       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM86_PF_GPTIMER16BADV4CC0_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM86_PF_SPGSS1_U5_CS0_CTS ((uint32_t)0x00000003U)

/* IOMUX_M33C1_PINCM87 Bits */
/* IOMUX_M33C1_PINCM87[WCOMP] Bits */
#define IOMUX_M33C1_PINCM87_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM87_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM87_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM87_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM87[WUEN] Bits */
#define IOMUX_M33C1_PINCM87_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM87_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM87_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM87_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM87[INV] Bits */
#define IOMUX_M33C1_PINCM87_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM87_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM87_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM87_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM87[Z1] Bits */
#define IOMUX_M33C1_PINCM87_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM87_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM87_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM87_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM87[INENA] Bits */
#define IOMUX_M33C1_PINCM87_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM87_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM87_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM87_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM87[PIPU] Bits */
#define IOMUX_M33C1_PINCM87_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM87_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM87_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM87_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM87[PIPD] Bits */
#define IOMUX_M33C1_PINCM87_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM87_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM87_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM87_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM87[PC] Bits */
#define IOMUX_M33C1_PINCM87_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM87_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM87_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM87_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM87[PF] Bits */
#define IOMUX_M33C1_PINCM87_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM87_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM87_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM87_PF_GPIO2_DIO09       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM87_PF_GPTIMER16BADV4CC0_CCP1_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM87_PF_SPGSS1_U5_POCI_RTS ((uint32_t)0x00000003U)

/* IOMUX_M33C1_PINCM88 Bits */
/* IOMUX_M33C1_PINCM88[WCOMP] Bits */
#define IOMUX_M33C1_PINCM88_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM88_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM88_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM88_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM88[WUEN] Bits */
#define IOMUX_M33C1_PINCM88_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM88_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM88_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM88_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM88[INV] Bits */
#define IOMUX_M33C1_PINCM88_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM88_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM88_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM88_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM88[Z1] Bits */
#define IOMUX_M33C1_PINCM88_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM88_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM88_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM88_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM88[INENA] Bits */
#define IOMUX_M33C1_PINCM88_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM88_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM88_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM88_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM88[PIPU] Bits */
#define IOMUX_M33C1_PINCM88_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM88_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM88_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM88_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM88[PIPD] Bits */
#define IOMUX_M33C1_PINCM88_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM88_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM88_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM88_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM88[PC] Bits */
#define IOMUX_M33C1_PINCM88_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM88_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM88_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM88_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM88[PF] Bits */
#define IOMUX_M33C1_PINCM88_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM88_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM88_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM88_PF_GPIO2_DIO10       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM88_PF_GPTIMER16B2CCQEILP1_CCP0 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM88_PF_SPGSS2_U3_SCL_RX  ((uint32_t)0x00000003U)

/* IOMUX_M33C1_PINCM89 Bits */
/* IOMUX_M33C1_PINCM89[WCOMP] Bits */
#define IOMUX_M33C1_PINCM89_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM89_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM89_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM89_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM89[WUEN] Bits */
#define IOMUX_M33C1_PINCM89_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM89_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM89_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM89_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM89[INV] Bits */
#define IOMUX_M33C1_PINCM89_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM89_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM89_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM89_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM89[Z1] Bits */
#define IOMUX_M33C1_PINCM89_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM89_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM89_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM89_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM89[INENA] Bits */
#define IOMUX_M33C1_PINCM89_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM89_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM89_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM89_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM89[PIPU] Bits */
#define IOMUX_M33C1_PINCM89_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM89_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM89_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM89_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM89[PIPD] Bits */
#define IOMUX_M33C1_PINCM89_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM89_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM89_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM89_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM89[PC] Bits */
#define IOMUX_M33C1_PINCM89_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM89_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM89_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM89_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM89[PF] Bits */
#define IOMUX_M33C1_PINCM89_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM89_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM89_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM89_PF_GPIO2_DIO11       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM89_PF_GPTIMER16B2CCQEILP1_CCP1 ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM89_PF_SPGSS2_U3_SDA_TX  ((uint32_t)0x00000003U)

