TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM90 Bits */
/* IOMUX_M33C1_PINCM90[WCOMP] Bits */
#define IOMUX_M33C1_PINCM90_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM90_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM90_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM90_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM90[WUEN] Bits */
#define IOMUX_M33C1_PINCM90_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM90_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM90_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM90_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM90[INV] Bits */
#define IOMUX_M33C1_PINCM90_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM90_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM90_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM90_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM90[Z1] Bits */
#define IOMUX_M33C1_PINCM90_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM90_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM90_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM90_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM90[INENA] Bits */
#define IOMUX_M33C1_PINCM90_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM90_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM90_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM90_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM90[PIPU] Bits */
#define IOMUX_M33C1_PINCM90_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM90_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM90_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM90_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM90[PIPD] Bits */
#define IOMUX_M33C1_PINCM90_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM90_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM90_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM90_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM90[PC] Bits */
#define IOMUX_M33C1_PINCM90_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM90_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM90_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM90_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM90[PF] Bits */
#define IOMUX_M33C1_PINCM90_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM90_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM90_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM90_PF_GPIO2_DIO25       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM90_PF_GPTIMER16B2CCQEILP1_IDX ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM90_PF_SPGSS2_U3_CTS     ((uint32_t)0x00000003U)

/* IOMUX_M33C1_PINCM91 Bits */
/* IOMUX_M33C1_PINCM91[WCOMP] Bits */
#define IOMUX_M33C1_PINCM91_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM91_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM91_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM91_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM91[WUEN] Bits */
#define IOMUX_M33C1_PINCM91_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM91_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM91_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM91_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM91[INV] Bits */
#define IOMUX_M33C1_PINCM91_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM91_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM91_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM91_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM91[Z1] Bits */
#define IOMUX_M33C1_PINCM91_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM91_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM91_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM91_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM91[INENA] Bits */
#define IOMUX_M33C1_PINCM91_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM91_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM91_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM91_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM91[PIPU] Bits */
#define IOMUX_M33C1_PINCM91_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM91_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM91_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM91_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM91[PIPD] Bits */
#define IOMUX_M33C1_PINCM91_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM91_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM91_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM91_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM91[PC] Bits */
#define IOMUX_M33C1_PINCM91_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM91_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM91_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM91_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM91[PF] Bits */
#define IOMUX_M33C1_PINCM91_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM91_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM91_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM91_PF_GPIO2_DIO26       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM91_PF_MCAN1_CANTX       ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM91_PF_SPGSS2_U3_RTS     ((uint32_t)0x00000003U)

/* IOMUX_M33C1_PINCM92 Bits */
/* IOMUX_M33C1_PINCM92[WCOMP] Bits */
#define IOMUX_M33C1_PINCM92_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM92_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM92_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM92_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM92[WUEN] Bits */
#define IOMUX_M33C1_PINCM92_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM92_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM92_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM92_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM92[INV] Bits */
#define IOMUX_M33C1_PINCM92_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM92_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM92_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM92_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM92[Z1] Bits */
#define IOMUX_M33C1_PINCM92_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM92_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM92_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM92_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM92[INENA] Bits */
#define IOMUX_M33C1_PINCM92_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM92_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM92_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM92_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM92[PIPU] Bits */
#define IOMUX_M33C1_PINCM92_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM92_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM92_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM92_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM92[PIPD] Bits */
#define IOMUX_M33C1_PINCM92_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM92_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM92_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM92_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM92[PC] Bits */
#define IOMUX_M33C1_PINCM92_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM92_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM92_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM92_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM92[PF] Bits */
#define IOMUX_M33C1_PINCM92_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM92_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM92_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM92_PF_GPIO2_DIO27       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM92_PF_MCAN1_CANRX       ((uint32_t)0x00000002U)

/* IOMUX_M33C1_PINCM93 Bits */
/* IOMUX_M33C1_PINCM93[WCOMP] Bits */
#define IOMUX_M33C1_PINCM93_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM93_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM93_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM93_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM93[WUEN] Bits */
#define IOMUX_M33C1_PINCM93_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM93_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM93_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM93_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM93[INV] Bits */
#define IOMUX_M33C1_PINCM93_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM93_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM93_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM93_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM93[Z1] Bits */
#define IOMUX_M33C1_PINCM93_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM93_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM93_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM93_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM93[INENA] Bits */
#define IOMUX_M33C1_PINCM93_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM93_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM93_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM93_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM93[PIPU] Bits */
#define IOMUX_M33C1_PINCM93_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM93_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM93_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM93_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM93[PIPD] Bits */
#define IOMUX_M33C1_PINCM93_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM93_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM93_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM93_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM93[PC] Bits */
#define IOMUX_M33C1_PINCM93_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM93_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM93_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM93_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM93[PF] Bits */
#define IOMUX_M33C1_PINCM93_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM93_PF_MASK              ((uint32_t)0x00000007U)         /* !< bit */
#define IOMUX_M33C1_PINCM93_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM93_PF_GPIO2_DIO28       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM93_PF_SPGSS2_U2_SCLK_SCL_RX ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM93_PF_SPGSS1_U4_TX      ((uint32_t)0x00000004U)

