TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_iomux_m33c1.h
/* IOMUX_M33C1_PINCM94 Bits */
/* IOMUX_M33C1_PINCM94[WCOMP] Bits */
#define IOMUX_M33C1_PINCM94_WCOMP_OFS            (28)                            /* !< WCOMP Offset */
#define IOMUX_M33C1_PINCM94_WCOMP_MASK           ((uint32_t)0x10000000U)         /* !< Wakeup Compare Value bit */
#define IOMUX_M33C1_PINCM94_WCOMP_MATCH0         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM94_WCOMP_MATCH1         ((uint32_t)0x10000000U)
/* IOMUX_M33C1_PINCM94[WUEN] Bits */
#define IOMUX_M33C1_PINCM94_WUEN_OFS             (27)                            /* !< WUEN Offset */
#define IOMUX_M33C1_PINCM94_WUEN_MASK            ((uint32_t)0x08000000U)         /* !< Wakeup Enable bit */
#define IOMUX_M33C1_PINCM94_WUEN_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM94_WUEN_ENABLE          ((uint32_t)0x08000000U)
/* IOMUX_M33C1_PINCM94[INV] Bits */
#define IOMUX_M33C1_PINCM94_INV_OFS              (26)                            /* !< INV Offset */
#define IOMUX_M33C1_PINCM94_INV_MASK             ((uint32_t)0x04000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM94_INV_DISABLE          ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM94_INV_ENABLE           ((uint32_t)0x04000000U)
/* IOMUX_M33C1_PINCM94[Z1] Bits */
#define IOMUX_M33C1_PINCM94_Z1_OFS               (25)                            /* !< Z1 Offset */
#define IOMUX_M33C1_PINCM94_Z1_MASK              ((uint32_t)0x02000000U)         /* !< bit */
#define IOMUX_M33C1_PINCM94_Z1_DISABLE           ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM94_Z1_ENABLE            ((uint32_t)0x02000000U)
/* IOMUX_M33C1_PINCM94[INENA] Bits */
#define IOMUX_M33C1_PINCM94_INENA_OFS            (18)                            /* !< INENA Offset */
#define IOMUX_M33C1_PINCM94_INENA_MASK           ((uint32_t)0x00040000U)         /* !< bit */
#define IOMUX_M33C1_PINCM94_INENA_PADCORE        ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM94_INENA_CORE0          ((uint32_t)0x00040000U)
/* IOMUX_M33C1_PINCM94[PIPU] Bits */
#define IOMUX_M33C1_PINCM94_PIPU_OFS             (17)                            /* !< PIPU Offset */
#define IOMUX_M33C1_PINCM94_PIPU_MASK            ((uint32_t)0x00020000U)         /* !< bit */
#define IOMUX_M33C1_PINCM94_PIPU_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM94_PIPU_ENABLE          ((uint32_t)0x00020000U)
/* IOMUX_M33C1_PINCM94[PIPD] Bits */
#define IOMUX_M33C1_PINCM94_PIPD_OFS             (16)                            /* !< PIPD Offset */
#define IOMUX_M33C1_PINCM94_PIPD_MASK            ((uint32_t)0x00010000U)         /* !< bit */
#define IOMUX_M33C1_PINCM94_PIPD_DISABLE         ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM94_PIPD_ENABLE          ((uint32_t)0x00010000U)
/* IOMUX_M33C1_PINCM94[PC] Bits */
#define IOMUX_M33C1_PINCM94_PC_OFS               (7)                             /* !< PC Offset */
#define IOMUX_M33C1_PINCM94_PC_MASK              ((uint32_t)0x00000080U)         /* !< bit */
#define IOMUX_M33C1_PINCM94_PC_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM94_PC_CONNECTED         ((uint32_t)0x00000080U)
/* IOMUX_M33C1_PINCM94[PF] Bits */
#define IOMUX_M33C1_PINCM94_PF_OFS               (0)                             /* !< PF Offset */
#define IOMUX_M33C1_PINCM94_PF_MASK              ((uint32_t)0x00000003U)         /* !< bit */
#define IOMUX_M33C1_PINCM94_PF_UNCONNECTED       ((uint32_t)0x00000000U)
#define IOMUX_M33C1_PINCM94_PF_GPIO2_DIO29       ((uint32_t)0x00000001U)
#define IOMUX_M33C1_PINCM94_PF_GPTIMER16BADV4CC1_CCP1_CMPL ((uint32_t)0x00000002U)
#define IOMUX_M33C1_PINCM94_PF_SPGSS2_U2_PICO_SDA_TX ((uint32_t)0x00000003U)


#ifdef __cplusplus
}
#endif

#endif /* ti_devices_msp_peripherals_hw_iomux_m33c1__include */

